microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
/* ***********************************************************************************************
 * File:        MA330048_P33CK_R30_pinmap.h                                                             
 * Author:      M91406                                                                         
 * Comments:    Hardware abstraction layer device pinout descriptor                                
 * Board ID:    MA330048_P33CK                                                                       
 * Date:        07/30/2019                                                                             
 * Build:       0016                                                                       
 *                                                                                                 
 * Description:                                                                                    
 * This is a header file template adding signal labels for the hardware abstraction layer          
 * In this example user defined signals are directly associated to specific device pins.           
 * These associations have been created using the MS Excel macro-based code generation tool        
 * MyBoard_RXX_pinout.xlsm located in the h/hal/config directory of the project.                   
 *                                                                                                 
 * Note:                                                                                           
 * This file is the junction point between hardware and microcontroller abstraction layer.         
 * To better separate them from each other (e.g. for supporting CPU cards in hardware platforms),  
 * generic signal labels may be used in these declarations, which can be used to associate MCU     
 * device pins in MCAL to signals defined in HAL.                                                  
 *                                                                                     
 * EXAMPLE OF BOTH USE CASES                                                           
 *                                                                                     
 * a) Direct pin assignment using ONE header file in HAL                               
 *                                                                                     
 *  File:       MyBoard_RXX_pinmap.h                                                   
 * -----------------------------------------------------------------------             
 *                                                                                     
 *              #define CLKOUT  _LATB1                                                 
 *                                                                                     
 * Any usage of the label CLKOUT in user code will automatically be mapped to the      
 * specific device pin RB1. Thus board hardware and MCU itself become independent,     
 * exchangeable elements in the firmware and pin-out changes made won't affect         
 * the rest of the firmware.                                                           
 *                                                                                     
 * However, although this assignment simplifies the hardware abstraction, HAL and MCAL 
 * are not clearly separated as MCU specific registers are assigned here.              
 *                                                                                     
 *                                                                                     
 * b) Indirect pin assignment using TWO header files in HAL and MCAL                   
 *          
 *  File:       MyBoard_RXX_pinmap.h            MyController_pinmap.h                  
 * -----------------------------------------------------------------------             
 *          
 *              #define CLKOUT  TP08            #define TP08    _LATB1                 
 *     
 * Any usage of the label CLKOUT in user code will automatically be mapped to the          
 * specific device pin RB1. Thus board hardware, MCU adapter card and MCU itself become    
 * independent, exchangeable elements in the firmware and changes made here won't affect   
 * the rest of the firmware.                                                           
 *                                                                                     
 * This functional assignment scheme clearly separates HAL and MCAL, but adds more complexity  
 * to the structure. This scheme works best when working with CPU adapter cards like   
 * Microchip's Digital Power Plug-In Modules.                                          
 *                                                                                     
 *                                                                                     
 * ***********************************************************************************************/    
// This is a guard condition so that contents of this file are not included
// more than once.
#ifndef __MA330048_P33CK_R30_PINMAP_H__
#define __MA330048_P33CK_R30_PINMAP_H__

#include <xc.h> // include processor files - each processor file is guarded 
#include <stdint.h> // Include standard integer types                       
#include <stdbool.h> // Include standard boolean types                      

/* @@PNMAP_VERSION
 * ***********************************************************************************************
 * Description:
 * This flag is a user defined flag helping to provide version information about the
 * pinmap file. This string can be used universally across the firmware to identify the
 * hardware version this firmware was written for.
 *
 * Please Note:
 * His label is not connected to the generic macro specified in the compiler settings
 * and need to maintained by the designer independently.
 * ***********************************************************************************************/

#define MA330048_PINMAP_VERSION  "R30"

/* ***********************************************************************************************/

// Generated Content: Generic defines used to map device pins to board signals
#ifndef PINDIR_INPUT
    #define PINDIR_INPUT 1
#endif
#ifndef PINDIR_OUTPUT
    #define PINDIR_OUTPUT 0
#endif

#ifndef PINSTATE_HIGH
    #define PINSTATE_HIGH 1
#endif
#ifndef PINSTATE_LOW
    #define PINSTATE_LOW 0
#endif

#ifndef PINCFG_OPEN_DRAIN
    #define PINCFG_OPEN_DRAIN 1
#endif
#ifndef PINCFG_PUSH_PULL
    #define PINCFG_PUSH_PULL 0
#endif

#ifndef LED_ON
    #define LED_ON 0
#endif
#ifndef LED_OFF
    #define LED_OFF 1
#endif

// Device Pin #28 is RB0
#define CLKI_TRIS    TRISBbits.TRISB0 // GPIO direction register bit
#define CLKI_WR      LATBbits.LATB0 // GPIO port latch register bit
#define CLKI_RD      PORTBbits.RB0 // GPIO port register bit
#define CLKI_ODC     ODCBbits.ODCB0 // GPIO port open drain configuration register bit
#define CLKI_CNPU    CNPUBbits.CNPUB0 // GPIO port pull-up resistor register bit
#define CLKI_CNPD    CNPDBbits.CNPDB0 // GPIO port pull-down resistor register bit
#define CLKI_CNEN0   CNEN0Bbits.CNEN0B0 // GPIO port change notification Enable register bit
#define CLKI_CNSTAT  CNSTATBbits.CNSTATB0 // GPIO port change notification Status register bit
#define CLKI_CNEN1   CNEN1Bbits.CNEN1B0 // GPIO port change notification Edge Select Enable register bit
#define CLKI_CNF     CNFBbits.CNFB0 // GPIO port change notification flag bit register bit
#define CLKI_RP      32 // Number of Remappable Pin
#define CLKI_SET     { asm volatile ("bset _LATB, #0 \n"); }
#define CLKI_CLEAR   { asm volatile ("bclr _LATB, #0 \n"); }
#define CLKI_TOGGLE  { asm volatile ("btg  _LATB, #0 \n"); }
#define CLKI_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define CLKI_ANSEL   _ANSELB0 // analog/digital pin configuration register bit
#define CLKI_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define CLKI_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define CLKI_ADC_AN_INPUT 5   // ANx input pin number
#define CLKI_ADCBUF  ADCBUF5 // ADC buffer register for this input
#define CLKI_ADC_ANIE ADIELbits.IE5
#define CLKI_ADC_ANEIE ADEIELbits.EIEN5
#define CLKI_ADC_IF   _ADCAN5IF // interrupt flag bit
#define CLKI_ADC_IE   _ADCAN5IE // interrupt enable bit
#define CLKI_ADC_IP   _ADCAN5IP // interrupt priority for this analog input
#define CLKI_ADC_RDY  _AN5RDY // ADC buffer ready bit
#define _CLKI_ADC_Interrupt _ADCAN5Interrupt
#define CLKI_INIT_ANALOG	{CLKI_ANSEL = 1; CLKI_WR = PINSTATE_HIGH; CLKI_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define CLKI_INIT_OUTPUT  {CLKI_WR = PINSTATE_LOW; CLKI_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define CLKI_INIT_INPUT   {CLKI_WR = PINSTATE_HIGH; CLKI_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #8 is RD15
#define DBGLED_TRIS    TRISDbits.TRISD15 // GPIO direction register bit
#define DBGLED_WR      LATDbits.LATD15 // GPIO port latch register bit
#define DBGLED_RD      PORTDbits.RD15 // GPIO port register bit
#define DBGLED_ODC     ODCDbits.ODCD15 // GPIO port open drain configuration register bit
#define DBGLED_CNPU    CNPUDbits.CNPUD15 // GPIO port pull-up resistor register bit
#define DBGLED_CNPD    CNPDDbits.CNPDD15 // GPIO port pull-down resistor register bit
#define DBGLED_CNEN0   CNEN0Dbits.CNEN0D15 // GPIO port change notification Enable register bit
#define DBGLED_CNSTAT  CNSTATDbits.CNSTATD15 // GPIO port change notification Status register bit
#define DBGLED_CNEN1   CNEN1Dbits.CNEN1D15 // GPIO port change notification Edge Select Enable register bit
#define DBGLED_CNF     CNFDbits.CNFD15 // GPIO port change notification flag bit register bit
#define DBGLED_RP      79 // Number of Remappable Pin
#define DBGLED_SET     { asm volatile ("bset _LATD, #15 \n"); }
#define DBGLED_CLEAR   { asm volatile ("bclr _LATD, #15 \n"); }
#define DBGLED_TOGGLE  { asm volatile ("btg  _LATD, #15 \n"); }
#define DBGLED_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define DBGLED_INIT_OUTPUT  {DBGLED_WR = PINSTATE_LOW; DBGLED_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define DBGLED_INIT_INPUT   {DBGLED_WR = PINSTATE_HIGH; DBGLED_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #21 is RD12
#define DBGPIN_TRIS    TRISDbits.TRISD12 // GPIO direction register bit
#define DBGPIN_WR      LATDbits.LATD12 // GPIO port latch register bit
#define DBGPIN_RD      PORTDbits.RD12 // GPIO port register bit
#define DBGPIN_ODC     ODCDbits.ODCD12 // GPIO port open drain configuration register bit
#define DBGPIN_CNPU    CNPUDbits.CNPUD12 // GPIO port pull-up resistor register bit
#define DBGPIN_CNPD    CNPDDbits.CNPDD12 // GPIO port pull-down resistor register bit
#define DBGPIN_CNEN0   CNEN0Dbits.CNEN0D12 // GPIO port change notification Enable register bit
#define DBGPIN_CNSTAT  CNSTATDbits.CNSTATD12 // GPIO port change notification Status register bit
#define DBGPIN_CNEN1   CNEN1Dbits.CNEN1D12 // GPIO port change notification Edge Select Enable register bit
#define DBGPIN_CNF     CNFDbits.CNFD12 // GPIO port change notification flag bit register bit
#define DBGPIN_RP      76 // Number of Remappable Pin
#define DBGPIN_SET     { asm volatile ("bset _LATD, #12 \n"); }
#define DBGPIN_CLEAR   { asm volatile ("bclr _LATD, #12 \n"); }
#define DBGPIN_TOGGLE  { asm volatile ("btg  _LATD, #12 \n"); }
#define DBGPIN_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define DBGPIN_INIT_OUTPUT  {DBGPIN_WR = PINSTATE_LOW; DBGPIN_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define DBGPIN_INIT_INPUT   {DBGPIN_WR = PINSTATE_HIGH; DBGPIN_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #17 is RA3
#define ECP03_TRIS    TRISAbits.TRISA3 // GPIO direction register bit
#define ECP03_WR      LATAbits.LATA3 // GPIO port latch register bit
#define ECP03_RD      PORTAbits.RA3 // GPIO port register bit
#define ECP03_ODC     ODCAbits.ODCA3 // GPIO port open drain configuration register bit
#define ECP03_CNPU    CNPUAbits.CNPUA3 // GPIO port pull-up resistor register bit
#define ECP03_CNPD    CNPDAbits.CNPDA3 // GPIO port pull-down resistor register bit
#define ECP03_CNEN0   CNEN0Abits.CNEN0A3 // GPIO port change notification Enable register bit
#define ECP03_CNSTAT  CNSTATAbits.CNSTATA3 // GPIO port change notification Status register bit
#define ECP03_CNEN1   CNEN1Abits.CNEN1A3 // GPIO port change notification Edge Select Enable register bit
#define ECP03_CNF     CNFAbits.CNFA3 // GPIO port change notification flag bit register bit
#define ECP03_SET     { asm volatile ("bset _LATA, #3 \n"); }
#define ECP03_CLEAR   { asm volatile ("bclr _LATA, #3 \n"); }
#define ECP03_TOGGLE  { asm volatile ("btg  _LATA, #3 \n"); }
#define ECP03_IS_ANALOG_INPUT  1 // Pin is/is not analog input 
#define ECP03_ANSEL   _ANSELA3 // analog/digital pin configuration register bit
#define ECP03_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP03_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP03_ADC_AN_INPUT 3   // ANx input pin number
#define ECP03_ADCBUF  ADCBUF3 // ADC buffer register for this input
#define ECP03_ADC_ANIE ADIELbits.IE3
#define ECP03_ADC_ANEIE ADEIELbits.EIEN3
#define ECP03_ADC_IF   _ADCAN3IF // interrupt flag bit
#define ECP03_ADC_IE   _ADCAN3IE // interrupt enable bit
#define ECP03_ADC_IP   _ADCAN3IP // interrupt priority for this analog input
#define ECP03_ADC_RDY  _AN3RDY // ADC buffer ready bit
#define _ECP03_ADC_Interrupt _ADCAN3Interrupt
#define ECP03_INIT_ANALOG	{ECP03_ANSEL = 1; ECP03_WR = PINSTATE_HIGH; ECP03_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP03_INIT_OUTPUT  {ECP03_WR = PINSTATE_LOW; ECP03_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP03_INIT_INPUT   {ECP03_WR = PINSTATE_HIGH; ECP03_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #27 is RC3
#define ECP04_TRIS    TRISCbits.TRISC3 // GPIO direction register bit
#define ECP04_WR      LATCbits.LATC3 // GPIO port latch register bit
#define ECP04_RD      PORTCbits.RC3 // GPIO port register bit
#define ECP04_ODC     ODCCbits.ODCC3 // GPIO port open drain configuration register bit
#define ECP04_CNPU    CNPUCbits.CNPUC3 // GPIO port pull-up resistor register bit
#define ECP04_CNPD    CNPDCbits.CNPDC3 // GPIO port pull-down resistor register bit
#define ECP04_CNEN0   CNEN0Cbits.CNEN0C3 // GPIO port change notification Enable register bit
#define ECP04_CNSTAT  CNSTATCbits.CNSTATC3 // GPIO port change notification Status register bit
#define ECP04_CNEN1   CNEN1Cbits.CNEN1C3 // GPIO port change notification Edge Select Enable register bit
#define ECP04_CNF     CNFCbits.CNFC3 // GPIO port change notification flag bit register bit
#define ECP04_RP      51 // Number of Remappable Pin
#define ECP04_SET     { asm volatile ("bset _LATC, #3 \n"); }
#define ECP04_CLEAR   { asm volatile ("bclr _LATC, #3 \n"); }
#define ECP04_TOGGLE  { asm volatile ("btg  _LATC, #3 \n"); }
#define ECP04_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP04_ANSEL   _ANSELC3 // analog/digital pin configuration register bit
#define ECP04_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP04_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP04_ADC_AN_INPUT 15   // ANx input pin number
#define ECP04_ADCBUF  ADCBUF15 // ADC buffer register for this input
#define ECP04_ADC_ANIE ADIELbits.IE15
#define ECP04_ADC_ANEIE ADEIELbits.EIEN15
#define ECP04_ADC_IF   _ADCAN15IF // interrupt flag bit
#define ECP04_ADC_IE   _ADCAN15IE // interrupt enable bit
#define ECP04_ADC_IP   _ADCAN15IP // interrupt priority for this analog input
#define ECP04_ADC_RDY  _AN15RDY // ADC buffer ready bit
#define _ECP04_ADC_Interrupt _ADCAN15Interrupt
#define ECP04_INIT_ANALOG	{ECP04_ANSEL = 1; ECP04_WR = PINSTATE_HIGH; ECP04_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP04_INIT_OUTPUT  {ECP04_WR = PINSTATE_LOW; ECP04_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP04_INIT_INPUT   {ECP04_WR = PINSTATE_HIGH; ECP04_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #48 is RB8
#define ECP05_TRIS    TRISBbits.TRISB8 // GPIO direction register bit
#define ECP05_WR      LATBbits.LATB8 // GPIO port latch register bit
#define ECP05_RD      PORTBbits.RB8 // GPIO port register bit
#define ECP05_ODC     ODCBbits.ODCB8 // GPIO port open drain configuration register bit
#define ECP05_CNPU    CNPUBbits.CNPUB8 // GPIO port pull-up resistor register bit
#define ECP05_CNPD    CNPDBbits.CNPDB8 // GPIO port pull-down resistor register bit
#define ECP05_CNEN0   CNEN0Bbits.CNEN0B8 // GPIO port change notification Enable register bit
#define ECP05_CNSTAT  CNSTATBbits.CNSTATB8 // GPIO port change notification Status register bit
#define ECP05_CNEN1   CNEN1Bbits.CNEN1B8 // GPIO port change notification Edge Select Enable register bit
#define ECP05_CNF     CNFBbits.CNFB8 // GPIO port change notification flag bit register bit
#define ECP05_RP      40 // Number of Remappable Pin
#define ECP05_SET     { asm volatile ("bset _LATB, #8 \n"); }
#define ECP05_CLEAR   { asm volatile ("bclr _LATB, #8 \n"); }
#define ECP05_TOGGLE  { asm volatile ("btg  _LATB, #8 \n"); }
#define ECP05_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP05_ANSEL   _ANSELB8 // analog/digital pin configuration register bit
#define ECP05_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP05_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP05_ADC_AN_INPUT 10   // ANx input pin number
#define ECP05_ADCBUF  ADCBUF10 // ADC buffer register for this input
#define ECP05_ADC_ANIE ADIELbits.IE10
#define ECP05_ADC_ANEIE ADEIELbits.EIEN10
#define ECP05_ADC_IF   _ADCAN10IF // interrupt flag bit
#define ECP05_ADC_IE   _ADCAN10IE // interrupt enable bit
#define ECP05_ADC_IP   _ADCAN10IP // interrupt priority for this analog input
#define ECP05_ADC_RDY  _AN10RDY // ADC buffer ready bit
#define _ECP05_ADC_Interrupt _ADCAN10Interrupt
#define ECP05_INIT_ANALOG	{ECP05_ANSEL = 1; ECP05_WR = PINSTATE_HIGH; ECP05_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP05_INIT_OUTPUT  {ECP05_WR = PINSTATE_LOW; ECP05_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP05_INIT_INPUT   {ECP05_WR = PINSTATE_HIGH; ECP05_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #33 is RB2
#define ECP06_TRIS    TRISBbits.TRISB2 // GPIO direction register bit
#define ECP06_WR      LATBbits.LATB2 // GPIO port latch register bit
#define ECP06_RD      PORTBbits.RB2 // GPIO port register bit
#define ECP06_ODC     ODCBbits.ODCB2 // GPIO port open drain configuration register bit
#define ECP06_CNPU    CNPUBbits.CNPUB2 // GPIO port pull-up resistor register bit
#define ECP06_CNPD    CNPDBbits.CNPDB2 // GPIO port pull-down resistor register bit
#define ECP06_CNEN0   CNEN0Bbits.CNEN0B2 // GPIO port change notification Enable register bit
#define ECP06_CNSTAT  CNSTATBbits.CNSTATB2 // GPIO port change notification Status register bit
#define ECP06_CNEN1   CNEN1Bbits.CNEN1B2 // GPIO port change notification Edge Select Enable register bit
#define ECP06_CNF     CNFBbits.CNFB2 // GPIO port change notification flag bit register bit
#define ECP06_RP      34 // Number of Remappable Pin
#define ECP06_SET     { asm volatile ("bset _LATB, #2 \n"); }
#define ECP06_CLEAR   { asm volatile ("bclr _LATB, #2 \n"); }
#define ECP06_TOGGLE  { asm volatile ("btg  _LATB, #2 \n"); }
#define ECP06_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP06_ANSEL   _ANSELB2 // analog/digital pin configuration register bit
#define ECP06_ADCCORE 0 // index starts from zero, last index indicated shared adC core
#define ECP06_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP06_ADC_AN_INPUT 0   // ANx input pin number
#define ECP06_ADCBUF  ADCBUF0 // ADC buffer register for this input
#define ECP06_ADC_ANIE ADIEHbits.IE0
#define ECP06_ADC_ANEIE ADEIEHbits.EIEN0
#define ECP06_ADC_IF   _ADCAN0IF // interrupt flag bit
#define ECP06_ADC_IE   _ADCAN0IE // interrupt enable bit
#define ECP06_ADC_IP   _ADCAN0IP // interrupt priority for this analog input
#define ECP06_ADC_RDY  _AN0RDY // ADC buffer ready bit
#define _ECP06_ADC_Interrupt _ADCAN0Interrupt
#define ECP06_INIT_ANALOG	{ECP06_ANSEL = 1; ECP06_WR = PINSTATE_HIGH; ECP06_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP06_INIT_OUTPUT  {ECP06_WR = PINSTATE_LOW; ECP06_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP06_INIT_INPUT   {ECP06_WR = PINSTATE_HIGH; ECP06_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #18 is RA4
#define ECP08_TRIS    TRISAbits.TRISA4 // GPIO direction register bit
#define ECP08_WR      LATAbits.LATA4 // GPIO port latch register bit
#define ECP08_RD      PORTAbits.RA4 // GPIO port register bit
#define ECP08_ODC     ODCAbits.ODCA4 // GPIO port open drain configuration register bit
#define ECP08_CNPU    CNPUAbits.CNPUA4 // GPIO port pull-up resistor register bit
#define ECP08_CNPD    CNPDAbits.CNPDA4 // GPIO port pull-down resistor register bit
#define ECP08_CNEN0   CNEN0Abits.CNEN0A4 // GPIO port change notification Enable register bit
#define ECP08_CNSTAT  CNSTATAbits.CNSTATA4 // GPIO port change notification Status register bit
#define ECP08_CNEN1   CNEN1Abits.CNEN1A4 // GPIO port change notification Edge Select Enable register bit
#define ECP08_CNF     CNFAbits.CNFA4 // GPIO port change notification flag bit register bit
#define ECP08_SET     { asm volatile ("bset _LATA, #4 \n"); }
#define ECP08_CLEAR   { asm volatile ("bclr _LATA, #4 \n"); }
#define ECP08_TOGGLE  { asm volatile ("btg  _LATA, #4 \n"); }
#define ECP08_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP08_ANSEL   _ANSELA4 // analog/digital pin configuration register bit
#define ECP08_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP08_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP08_ADC_AN_INPUT 4   // ANx input pin number
#define ECP08_ADCBUF  ADCBUF4 // ADC buffer register for this input
#define ECP08_ADC_ANIE ADIELbits.IE4
#define ECP08_ADC_ANEIE ADEIELbits.EIEN4
#define ECP08_ADC_IF   _ADCAN4IF // interrupt flag bit
#define ECP08_ADC_IE   _ADCAN4IE // interrupt enable bit
#define ECP08_ADC_IP   _ADCAN4IP // interrupt priority for this analog input
#define ECP08_ADC_RDY  _AN4RDY // ADC buffer ready bit
#define _ECP08_ADC_Interrupt _ADCAN4Interrupt
#define ECP08_INIT_ANALOG	{ECP08_ANSEL = 1; ECP08_WR = PINSTATE_HIGH; ECP08_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP08_INIT_OUTPUT  {ECP08_WR = PINSTATE_LOW; ECP08_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP08_INIT_INPUT   {ECP08_WR = PINSTATE_HIGH; ECP08_TRIS = PINDIR_INPUT;} // initialization macro for digital input

