microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #24 is RC6
#define ECP09_TRIS    TRISCbits.TRISC6 // GPIO direction register bit
#define ECP09_WR      LATCbits.LATC6 // GPIO port latch register bit
#define ECP09_RD      PORTCbits.RC6 // GPIO port register bit
#define ECP09_ODC     ODCCbits.ODCC6 // GPIO port open drain configuration register bit
#define ECP09_CNPU    CNPUCbits.CNPUC6 // GPIO port pull-up resistor register bit
#define ECP09_CNPD    CNPDCbits.CNPDC6 // GPIO port pull-down resistor register bit
#define ECP09_CNEN0   CNEN0Cbits.CNEN0C6 // GPIO port change notification Enable register bit
#define ECP09_CNSTAT  CNSTATCbits.CNSTATC6 // GPIO port change notification Status register bit
#define ECP09_CNEN1   CNEN1Cbits.CNEN1C6 // GPIO port change notification Edge Select Enable register bit
#define ECP09_CNF     CNFCbits.CNFC6 // GPIO port change notification flag bit register bit
#define ECP09_RP      54 // Number of Remappable Pin
#define ECP09_SET     { asm volatile ("bset _LATC, #6 \n"); }
#define ECP09_CLEAR   { asm volatile ("bclr _LATC, #6 \n"); }
#define ECP09_TOGGLE  { asm volatile ("btg  _LATC, #6 \n"); }
#define ECP09_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP09_ANSEL   _ANSELC6 // analog/digital pin configuration register bit
#define ECP09_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP09_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP09_ADC_AN_INPUT 17   // ANx input pin number
#define ECP09_ADCBUF  ADCBUF17 // ADC buffer register for this input
#define ECP09_ADC_ANIE ADIEHbits.IE17
#define ECP09_ADC_ANEIE ADEIEHbits.EIEN17
#define ECP09_ADC_IF   _ADCAN17IF // interrupt flag bit
#define ECP09_ADC_IE   _ADCAN17IE // interrupt enable bit
#define ECP09_ADC_IP   _ADCAN17IP // interrupt priority for this analog input
#define ECP09_ADC_RDY  _AN17RDY // ADC buffer ready bit
#define _ECP09_ADC_Interrupt _ADCAN17Interrupt
#define ECP09_INIT_ANALOG	{ECP09_ANSEL = 1; ECP09_WR = PINSTATE_HIGH; ECP09_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP09_INIT_OUTPUT  {ECP09_WR = PINSTATE_LOW; ECP09_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP09_INIT_INPUT   {ECP09_WR = PINSTATE_HIGH; ECP09_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #47 is RB7
#define ECP10_TRIS    TRISBbits.TRISB7 // GPIO direction register bit
#define ECP10_WR      LATBbits.LATB7 // GPIO port latch register bit
#define ECP10_RD      PORTBbits.RB7 // GPIO port register bit
#define ECP10_ODC     ODCBbits.ODCB7 // GPIO port open drain configuration register bit
#define ECP10_CNPU    CNPUBbits.CNPUB7 // GPIO port pull-up resistor register bit
#define ECP10_CNPD    CNPDBbits.CNPDB7 // GPIO port pull-down resistor register bit
#define ECP10_CNEN0   CNEN0Bbits.CNEN0B7 // GPIO port change notification Enable register bit
#define ECP10_CNSTAT  CNSTATBbits.CNSTATB7 // GPIO port change notification Status register bit
#define ECP10_CNEN1   CNEN1Bbits.CNEN1B7 // GPIO port change notification Edge Select Enable register bit
#define ECP10_CNF     CNFBbits.CNFB7 // GPIO port change notification flag bit register bit
#define ECP10_RP      39 // Number of Remappable Pin
#define ECP10_SET     { asm volatile ("bset _LATB, #7 \n"); }
#define ECP10_CLEAR   { asm volatile ("bclr _LATB, #7 \n"); }
#define ECP10_TOGGLE  { asm volatile ("btg  _LATB, #7 \n"); }
#define ECP10_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP10_ANSEL   _ANSELB7 // analog/digital pin configuration register bit
#define ECP10_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP10_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP10_ADC_AN_INPUT 2   // ANx input pin number
#define ECP10_ADCBUF  ADCBUF2 // ADC buffer register for this input
#define ECP10_ADC_ANIE ADIELbits.IE2
#define ECP10_ADC_ANEIE ADEIELbits.EIEN2
#define ECP10_ADC_IF   _ADCAN2IF // interrupt flag bit
#define ECP10_ADC_IE   _ADCAN2IE // interrupt enable bit
#define ECP10_ADC_IP   _ADCAN2IP // interrupt priority for this analog input
#define ECP10_ADC_RDY  _AN2RDY // ADC buffer ready bit
#define _ECP10_ADC_Interrupt _ADCAN2Interrupt
#define ECP10_INIT_ANALOG	{ECP10_ANSEL = 1; ECP10_WR = PINSTATE_HIGH; ECP10_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP10_INIT_OUTPUT  {ECP10_WR = PINSTATE_LOW; ECP10_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP10_INIT_INPUT   {ECP10_WR = PINSTATE_HIGH; ECP10_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #15 is RA1
#define ECP11_TRIS    TRISAbits.TRISA1 // GPIO direction register bit
#define ECP11_WR      LATAbits.LATA1 // GPIO port latch register bit
#define ECP11_RD      PORTAbits.RA1 // GPIO port register bit
#define ECP11_ODC     ODCAbits.ODCA1 // GPIO port open drain configuration register bit
#define ECP11_CNPU    CNPUAbits.CNPUA1 // GPIO port pull-up resistor register bit
#define ECP11_CNPD    CNPDAbits.CNPDA1 // GPIO port pull-down resistor register bit
#define ECP11_CNEN0   CNEN0Abits.CNEN0A1 // GPIO port change notification Enable register bit
#define ECP11_CNSTAT  CNSTATAbits.CNSTATA1 // GPIO port change notification Status register bit
#define ECP11_CNEN1   CNEN1Abits.CNEN1A1 // GPIO port change notification Edge Select Enable register bit
#define ECP11_CNF     CNFAbits.CNFA1 // GPIO port change notification flag bit register bit
#define ECP11_SET     { asm volatile ("bset _LATA, #1 \n"); }
#define ECP11_CLEAR   { asm volatile ("bclr _LATA, #1 \n"); }
#define ECP11_TOGGLE  { asm volatile ("btg  _LATA, #1 \n"); }
#define ECP11_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP11_ANSEL   _ANSELA1 // analog/digital pin configuration register bit
#define ECP11_ADCCORE 1 // index starts from zero, last index indicated shared adC core
#define ECP11_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP11_ADC_AN_INPUT 1   // ANx input pin number
#define ECP11_ADCBUF  ADCBUF1 // ADC buffer register for this input
#define ECP11_ADC_ANIE ADIEHbits.IE1
#define ECP11_ADC_ANEIE ADEIEHbits.EIEN1
#define ECP11_ADC_IF   _ADCAN1IF // interrupt flag bit
#define ECP11_ADC_IE   _ADCAN1IE // interrupt enable bit
#define ECP11_ADC_IP   _ADCAN1IP // interrupt priority for this analog input
#define ECP11_ADC_RDY  _AN1RDY // ADC buffer ready bit
#define _ECP11_ADC_Interrupt _ADCAN1Interrupt
#define ECP11_INIT_ANALOG	{ECP11_ANSEL = 1; ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP11_INIT_OUTPUT  {ECP11_WR = PINSTATE_LOW; ECP11_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP11_INIT_INPUT   {ECP11_WR = PINSTATE_HIGH; ECP11_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #14 is RA0
#define ECP12_TRIS    TRISAbits.TRISA0 // GPIO direction register bit
#define ECP12_WR      LATAbits.LATA0 // GPIO port latch register bit
#define ECP12_RD      PORTAbits.RA0 // GPIO port register bit
#define ECP12_ODC     ODCAbits.ODCA0 // GPIO port open drain configuration register bit
#define ECP12_CNPU    CNPUAbits.CNPUA0 // GPIO port pull-up resistor register bit
#define ECP12_CNPD    CNPDAbits.CNPDA0 // GPIO port pull-down resistor register bit
#define ECP12_CNEN0   CNEN0Abits.CNEN0A0 // GPIO port change notification Enable register bit
#define ECP12_CNSTAT  CNSTATAbits.CNSTATA0 // GPIO port change notification Status register bit
#define ECP12_CNEN1   CNEN1Abits.CNEN1A0 // GPIO port change notification Edge Select Enable register bit
#define ECP12_CNF     CNFAbits.CNFA0 // GPIO port change notification flag bit register bit
#define ECP12_SET     { asm volatile ("bset _LATA, #0 \n"); }
#define ECP12_CLEAR   { asm volatile ("bclr _LATA, #0 \n"); }
#define ECP12_TOGGLE  { asm volatile ("btg  _LATA, #0 \n"); }
#define ECP12_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP12_ANSEL   _ANSELA0 // analog/digital pin configuration register bit
#define ECP12_ADCCORE 0 // index starts from zero, last index indicated shared adC core
#define ECP12_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP12_ADC_AN_INPUT 0   // ANx input pin number
#define ECP12_ADCBUF  ADCBUF0 // ADC buffer register for this input
#define ECP12_ADC_ANIE ADIELbits.IE0
#define ECP12_ADC_ANEIE ADEIELbits.EIEN0
#define ECP12_ADC_IF   _ADCAN0IF // interrupt flag bit
#define ECP12_ADC_IE   _ADCAN0IE // interrupt enable bit
#define ECP12_ADC_IP   _ADCAN0IP // interrupt priority for this analog input
#define ECP12_ADC_RDY  _AN0RDY // ADC buffer ready bit
#define _ECP12_ADC_Interrupt _ADCAN0Interrupt
#define ECP12_INIT_ANALOG	{ECP12_ANSEL = 1; ECP12_WR = PINSTATE_HIGH; ECP12_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP12_INIT_OUTPUT  {ECP12_WR = PINSTATE_LOW; ECP12_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP12_INIT_INPUT   {ECP12_WR = PINSTATE_HIGH; ECP12_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #30 is RD11
#define ECP13_TRIS    TRISDbits.TRISD11 // GPIO direction register bit
#define ECP13_WR      LATDbits.LATD11 // GPIO port latch register bit
#define ECP13_RD      PORTDbits.RD11 // GPIO port register bit
#define ECP13_ODC     ODCDbits.ODCD11 // GPIO port open drain configuration register bit
#define ECP13_CNPU    CNPUDbits.CNPUD11 // GPIO port pull-up resistor register bit
#define ECP13_CNPD    CNPDDbits.CNPDD11 // GPIO port pull-down resistor register bit
#define ECP13_CNEN0   CNEN0Dbits.CNEN0D11 // GPIO port change notification Enable register bit
#define ECP13_CNSTAT  CNSTATDbits.CNSTATD11 // GPIO port change notification Status register bit
#define ECP13_CNEN1   CNEN1Dbits.CNEN1D11 // GPIO port change notification Edge Select Enable register bit
#define ECP13_CNF     CNFDbits.CNFD11 // GPIO port change notification flag bit register bit
#define ECP13_RP      75 // Number of Remappable Pin
#define ECP13_SET     { asm volatile ("bset _LATD, #11 \n"); }
#define ECP13_CLEAR   { asm volatile ("bclr _LATD, #11 \n"); }
#define ECP13_TOGGLE  { asm volatile ("btg  _LATD, #11 \n"); }
#define ECP13_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP13_ANSEL   _ANSELD11 // analog/digital pin configuration register bit
#define ECP13_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP13_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP13_ADC_AN_INPUT 19   // ANx input pin number
#define ECP13_ADCBUF  ADCBUF19 // ADC buffer register for this input
#define ECP13_ADC_ANIE ADIEHbits.IE19
#define ECP13_ADC_ANEIE ADEIEHbits.EIEN19
#define ECP13_ADC_IF   _ADCAN19IF // interrupt flag bit
#define ECP13_ADC_IE   _ADCAN19IE // interrupt enable bit
#define ECP13_ADC_IP   _ADCAN19IP // interrupt priority for this analog input
#define ECP13_ADC_RDY  _AN19RDY // ADC buffer ready bit
#define _ECP13_ADC_Interrupt _ADCAN19Interrupt
#define ECP13_INIT_ANALOG	{ECP13_ANSEL = 1; ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP13_INIT_OUTPUT  {ECP13_WR = PINSTATE_LOW; ECP13_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP13_INIT_INPUT   {ECP13_WR = PINSTATE_HIGH; ECP13_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #32 is RC7
#define ECP14_TRIS    TRISCbits.TRISC7 // GPIO direction register bit
#define ECP14_WR      LATCbits.LATC7 // GPIO port latch register bit
#define ECP14_RD      PORTCbits.RC7 // GPIO port register bit
#define ECP14_ODC     ODCCbits.ODCC7 // GPIO port open drain configuration register bit
#define ECP14_CNPU    CNPUCbits.CNPUC7 // GPIO port pull-up resistor register bit
#define ECP14_CNPD    CNPDCbits.CNPDC7 // GPIO port pull-down resistor register bit
#define ECP14_CNEN0   CNEN0Cbits.CNEN0C7 // GPIO port change notification Enable register bit
#define ECP14_CNSTAT  CNSTATCbits.CNSTATC7 // GPIO port change notification Status register bit
#define ECP14_CNEN1   CNEN1Cbits.CNEN1C7 // GPIO port change notification Edge Select Enable register bit
#define ECP14_CNF     CNFCbits.CNFC7 // GPIO port change notification flag bit register bit
#define ECP14_RP      55 // Number of Remappable Pin
#define ECP14_SET     { asm volatile ("bset _LATC, #7 \n"); }
#define ECP14_CLEAR   { asm volatile ("bclr _LATC, #7 \n"); }
#define ECP14_TOGGLE  { asm volatile ("btg  _LATC, #7 \n"); }
#define ECP14_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP14_ANSEL   _ANSELC7 // analog/digital pin configuration register bit
#define ECP14_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP14_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP14_ADC_AN_INPUT 16   // ANx input pin number
#define ECP14_ADCBUF  ADCBUF16 // ADC buffer register for this input
#define ECP14_ADC_ANIE ADIEHbits.IE16
#define ECP14_ADC_ANEIE ADEIEHbits.EIEN16
#define ECP14_ADC_IF   _ADCAN16IF // interrupt flag bit
#define ECP14_ADC_IE   _ADCAN16IE // interrupt enable bit
#define ECP14_ADC_IP   _ADCAN16IP // interrupt priority for this analog input
#define ECP14_ADC_RDY  _AN16RDY // ADC buffer ready bit
#define _ECP14_ADC_Interrupt _ADCAN16Interrupt
#define ECP14_INIT_ANALOG	{ECP14_ANSEL = 1; ECP14_WR = PINSTATE_HIGH; ECP14_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP14_INIT_OUTPUT  {ECP14_WR = PINSTATE_LOW; ECP14_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP14_INIT_INPUT   {ECP14_WR = PINSTATE_HIGH; ECP14_TRIS = PINDIR_INPUT;} // initialization macro for digital input

