microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #31 is RD10
#define ECP15_TRIS    TRISDbits.TRISD10 // GPIO direction register bit
#define ECP15_WR      LATDbits.LATD10 // GPIO port latch register bit
#define ECP15_RD      PORTDbits.RD10 // GPIO port register bit
#define ECP15_ODC     ODCDbits.ODCD10 // GPIO port open drain configuration register bit
#define ECP15_CNPU    CNPUDbits.CNPUD10 // GPIO port pull-up resistor register bit
#define ECP15_CNPD    CNPDDbits.CNPDD10 // GPIO port pull-down resistor register bit
#define ECP15_CNEN0   CNEN0Dbits.CNEN0D10 // GPIO port change notification Enable register bit
#define ECP15_CNSTAT  CNSTATDbits.CNSTATD10 // GPIO port change notification Status register bit
#define ECP15_CNEN1   CNEN1Dbits.CNEN1D10 // GPIO port change notification Edge Select Enable register bit
#define ECP15_CNF     CNFDbits.CNFD10 // GPIO port change notification flag bit register bit
#define ECP15_RP      74 // Number of Remappable Pin
#define ECP15_SET     { asm volatile ("bset _LATD, #10 \n"); }
#define ECP15_CLEAR   { asm volatile ("bclr _LATD, #10 \n"); }
#define ECP15_TOGGLE  { asm volatile ("btg  _LATD, #10 \n"); }
#define ECP15_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP15_ANSEL   _ANSELD10 // analog/digital pin configuration register bit
#define ECP15_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP15_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP15_ADC_AN_INPUT 18   // ANx input pin number
#define ECP15_ADCBUF  ADCBUF18 // ADC buffer register for this input
#define ECP15_ADC_ANIE ADIEHbits.IE18
#define ECP15_ADC_ANEIE ADEIEHbits.EIEN18
#define ECP15_ADC_IF   _ADCAN18IF // interrupt flag bit
#define ECP15_ADC_IE   _ADCAN18IE // interrupt enable bit
#define ECP15_ADC_IP   _ADCAN18IP // interrupt priority for this analog input
#define ECP15_ADC_RDY  _AN18RDY // ADC buffer ready bit
#define _ECP15_ADC_Interrupt _ADCAN18Interrupt
#define ECP15_INIT_ANALOG	{ECP15_ANSEL = 1; ECP15_WR = PINSTATE_HIGH; ECP15_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP15_INIT_OUTPUT  {ECP15_WR = PINSTATE_LOW; ECP15_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP15_INIT_INPUT   {ECP15_WR = PINSTATE_HIGH; ECP15_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #13 is RC0
#define ECP16_TRIS    TRISCbits.TRISC0 // GPIO direction register bit
#define ECP16_WR      LATCbits.LATC0 // GPIO port latch register bit
#define ECP16_RD      PORTCbits.RC0 // GPIO port register bit
#define ECP16_ODC     ODCCbits.ODCC0 // GPIO port open drain configuration register bit
#define ECP16_CNPU    CNPUCbits.CNPUC0 // GPIO port pull-up resistor register bit
#define ECP16_CNPD    CNPDCbits.CNPDC0 // GPIO port pull-down resistor register bit
#define ECP16_CNEN0   CNEN0Cbits.CNEN0C0 // GPIO port change notification Enable register bit
#define ECP16_CNSTAT  CNSTATCbits.CNSTATC0 // GPIO port change notification Status register bit
#define ECP16_CNEN1   CNEN1Cbits.CNEN1C0 // GPIO port change notification Edge Select Enable register bit
#define ECP16_CNF     CNFCbits.CNFC0 // GPIO port change notification flag bit register bit
#define ECP16_RP      48 // Number of Remappable Pin
#define ECP16_SET     { asm volatile ("bset _LATC, #0 \n"); }
#define ECP16_CLEAR   { asm volatile ("bclr _LATC, #0 \n"); }
#define ECP16_TOGGLE  { asm volatile ("btg  _LATC, #0 \n"); }
#define ECP16_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP16_ANSEL   _ANSELC0 // analog/digital pin configuration register bit
#define ECP16_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP16_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP16_ADC_AN_INPUT 12   // ANx input pin number
#define ECP16_ADCBUF  ADCBUF12 // ADC buffer register for this input
#define ECP16_ADC_ANIE ADIELbits.IE12
#define ECP16_ADC_ANEIE ADEIELbits.EIEN12
#define ECP16_ADC_IF   _ADCAN12IF // interrupt flag bit
#define ECP16_ADC_IE   _ADCAN12IE // interrupt enable bit
#define ECP16_ADC_IP   _ADCAN12IP // interrupt priority for this analog input
#define ECP16_ADC_RDY  _AN12RDY // ADC buffer ready bit
#define _ECP16_ADC_Interrupt _ADCAN12Interrupt
#define ECP16_INIT_ANALOG	{ECP16_ANSEL = 1; ECP16_WR = PINSTATE_HIGH; ECP16_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP16_INIT_OUTPUT  {ECP16_WR = PINSTATE_LOW; ECP16_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP16_INIT_INPUT   {ECP16_WR = PINSTATE_HIGH; ECP16_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #23 is RC2
#define ECP17_TRIS    TRISCbits.TRISC2 // GPIO direction register bit
#define ECP17_WR      LATCbits.LATC2 // GPIO port latch register bit
#define ECP17_RD      PORTCbits.RC2 // GPIO port register bit
#define ECP17_ODC     ODCCbits.ODCC2 // GPIO port open drain configuration register bit
#define ECP17_CNPU    CNPUCbits.CNPUC2 // GPIO port pull-up resistor register bit
#define ECP17_CNPD    CNPDCbits.CNPDC2 // GPIO port pull-down resistor register bit
#define ECP17_CNEN0   CNEN0Cbits.CNEN0C2 // GPIO port change notification Enable register bit
#define ECP17_CNSTAT  CNSTATCbits.CNSTATC2 // GPIO port change notification Status register bit
#define ECP17_CNEN1   CNEN1Cbits.CNEN1C2 // GPIO port change notification Edge Select Enable register bit
#define ECP17_CNF     CNFCbits.CNFC2 // GPIO port change notification flag bit register bit
#define ECP17_RP      50 // Number of Remappable Pin
#define ECP17_SET     { asm volatile ("bset _LATC, #2 \n"); }
#define ECP17_CLEAR   { asm volatile ("bclr _LATC, #2 \n"); }
#define ECP17_TOGGLE  { asm volatile ("btg  _LATC, #2 \n"); }
#define ECP17_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP17_ANSEL   _ANSELC2 // analog/digital pin configuration register bit
#define ECP17_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP17_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP17_ADC_AN_INPUT 14   // ANx input pin number
#define ECP17_ADCBUF  ADCBUF14 // ADC buffer register for this input
#define ECP17_ADC_ANIE ADIELbits.IE14
#define ECP17_ADC_ANEIE ADEIELbits.EIEN14
#define ECP17_ADC_IF   _ADCAN14IF // interrupt flag bit
#define ECP17_ADC_IE   _ADCAN14IE // interrupt enable bit
#define ECP17_ADC_IP   _ADCAN14IP // interrupt priority for this analog input
#define ECP17_ADC_RDY  _AN14RDY // ADC buffer ready bit
#define _ECP17_ADC_Interrupt _ADCAN14Interrupt
#define ECP17_INIT_ANALOG	{ECP17_ANSEL = 1; ECP17_WR = PINSTATE_HIGH; ECP17_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP17_INIT_OUTPUT  {ECP17_WR = PINSTATE_LOW; ECP17_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP17_INIT_INPUT   {ECP17_WR = PINSTATE_HIGH; ECP17_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #22 is RC1
#define ECP18_TRIS    TRISCbits.TRISC1 // GPIO direction register bit
#define ECP18_WR      LATCbits.LATC1 // GPIO port latch register bit
#define ECP18_RD      PORTCbits.RC1 // GPIO port register bit
#define ECP18_ODC     ODCCbits.ODCC1 // GPIO port open drain configuration register bit
#define ECP18_CNPU    CNPUCbits.CNPUC1 // GPIO port pull-up resistor register bit
#define ECP18_CNPD    CNPDCbits.CNPDC1 // GPIO port pull-down resistor register bit
#define ECP18_CNEN0   CNEN0Cbits.CNEN0C1 // GPIO port change notification Enable register bit
#define ECP18_CNSTAT  CNSTATCbits.CNSTATC1 // GPIO port change notification Status register bit
#define ECP18_CNEN1   CNEN1Cbits.CNEN1C1 // GPIO port change notification Edge Select Enable register bit
#define ECP18_CNF     CNFCbits.CNFC1 // GPIO port change notification flag bit register bit
#define ECP18_RP      49 // Number of Remappable Pin
#define ECP18_SET     { asm volatile ("bset _LATC, #1 \n"); }
#define ECP18_CLEAR   { asm volatile ("bclr _LATC, #1 \n"); }
#define ECP18_TOGGLE  { asm volatile ("btg  _LATC, #1 \n"); }
#define ECP18_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP18_ANSEL   _ANSELC1 // analog/digital pin configuration register bit
#define ECP18_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP18_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP18_ADC_AN_INPUT 13   // ANx input pin number
#define ECP18_ADCBUF  ADCBUF13 // ADC buffer register for this input
#define ECP18_ADC_ANIE ADIELbits.IE13
#define ECP18_ADC_ANEIE ADEIELbits.EIEN13
#define ECP18_ADC_IF   _ADCAN13IF // interrupt flag bit
#define ECP18_ADC_IE   _ADCAN13IE // interrupt enable bit
#define ECP18_ADC_IP   _ADCAN13IP // interrupt priority for this analog input
#define ECP18_ADC_RDY  _AN13RDY // ADC buffer ready bit
#define _ECP18_ADC_Interrupt _ADCAN13Interrupt
#define ECP18_INIT_ANALOG	{ECP18_ANSEL = 1; ECP18_WR = PINSTATE_HIGH; ECP18_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP18_INIT_OUTPUT  {ECP18_WR = PINSTATE_LOW; ECP18_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP18_INIT_INPUT   {ECP18_WR = PINSTATE_HIGH; ECP18_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #16 is RA2
#define ECP19_TRIS    TRISAbits.TRISA2 // GPIO direction register bit
#define ECP19_WR      LATAbits.LATA2 // GPIO port latch register bit
#define ECP19_RD      PORTAbits.RA2 // GPIO port register bit
#define ECP19_ODC     ODCAbits.ODCA2 // GPIO port open drain configuration register bit
#define ECP19_CNPU    CNPUAbits.CNPUA2 // GPIO port pull-up resistor register bit
#define ECP19_CNPD    CNPDAbits.CNPDA2 // GPIO port pull-down resistor register bit
#define ECP19_CNEN0   CNEN0Abits.CNEN0A2 // GPIO port change notification Enable register bit
#define ECP19_CNSTAT  CNSTATAbits.CNSTATA2 // GPIO port change notification Status register bit
#define ECP19_CNEN1   CNEN1Abits.CNEN1A2 // GPIO port change notification Edge Select Enable register bit
#define ECP19_CNF     CNFAbits.CNFA2 // GPIO port change notification flag bit register bit
#define ECP19_SET     { asm volatile ("bset _LATA, #2 \n"); }
#define ECP19_CLEAR   { asm volatile ("bclr _LATA, #2 \n"); }
#define ECP19_TOGGLE  { asm volatile ("btg  _LATA, #2 \n"); }
#define ECP19_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP19_ANSEL   _ANSELA2 // analog/digital pin configuration register bit
#define ECP19_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP19_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP19_ADC_AN_INPUT 9   // ANx input pin number
#define ECP19_ADCBUF  ADCBUF9 // ADC buffer register for this input
#define ECP19_ADC_ANIE ADIELbits.IE9
#define ECP19_ADC_ANEIE ADEIELbits.EIEN9
#define ECP19_ADC_IF   _ADCAN9IF // interrupt flag bit
#define ECP19_ADC_IE   _ADCAN9IE // interrupt enable bit
#define ECP19_ADC_IP   _ADCAN9IP // interrupt priority for this analog input
#define ECP19_ADC_RDY  _AN9RDY // ADC buffer ready bit
#define _ECP19_ADC_Interrupt _ADCAN9Interrupt
#define ECP19_INIT_ANALOG	{ECP19_ANSEL = 1; ECP19_WR = PINSTATE_HIGH; ECP19_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP19_INIT_OUTPUT  {ECP19_WR = PINSTATE_LOW; ECP19_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP19_INIT_INPUT   {ECP19_WR = PINSTATE_HIGH; ECP19_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #29 is RB1
#define ECP20_TRIS    TRISBbits.TRISB1 // GPIO direction register bit
#define ECP20_WR      LATBbits.LATB1 // GPIO port latch register bit
#define ECP20_RD      PORTBbits.RB1 // GPIO port register bit
#define ECP20_ODC     ODCBbits.ODCB1 // GPIO port open drain configuration register bit
#define ECP20_CNPU    CNPUBbits.CNPUB1 // GPIO port pull-up resistor register bit
#define ECP20_CNPD    CNPDBbits.CNPDB1 // GPIO port pull-down resistor register bit
#define ECP20_CNEN0   CNEN0Bbits.CNEN0B1 // GPIO port change notification Enable register bit
#define ECP20_CNSTAT  CNSTATBbits.CNSTATB1 // GPIO port change notification Status register bit
#define ECP20_CNEN1   CNEN1Bbits.CNEN1B1 // GPIO port change notification Edge Select Enable register bit
#define ECP20_CNF     CNFBbits.CNFB1 // GPIO port change notification flag bit register bit
#define ECP20_RP      33 // Number of Remappable Pin
#define ECP20_SET     { asm volatile ("bset _LATB, #1 \n"); }
#define ECP20_CLEAR   { asm volatile ("bclr _LATB, #1 \n"); }
#define ECP20_TOGGLE  { asm volatile ("btg  _LATB, #1 \n"); }
#define ECP20_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP20_ANSEL   _ANSELB1 // analog/digital pin configuration register bit
#define ECP20_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP20_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP20_ADC_AN_INPUT 6   // ANx input pin number
#define ECP20_ADCBUF  ADCBUF6 // ADC buffer register for this input
#define ECP20_ADC_ANIE ADIELbits.IE6
#define ECP20_ADC_ANEIE ADEIELbits.EIEN6
#define ECP20_ADC_IF   _ADCAN6IF // interrupt flag bit
#define ECP20_ADC_IE   _ADCAN6IE // interrupt enable bit
#define ECP20_ADC_IP   _ADCAN6IP // interrupt priority for this analog input
#define ECP20_ADC_RDY  _AN6RDY // ADC buffer ready bit
#define _ECP20_ADC_Interrupt _ADCAN6Interrupt
#define ECP20_INIT_ANALOG	{ECP20_ANSEL = 1; ECP20_WR = PINSTATE_HIGH; ECP20_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP20_INIT_OUTPUT  {ECP20_WR = PINSTATE_LOW; ECP20_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP20_INIT_INPUT   {ECP20_WR = PINSTATE_HIGH; ECP20_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #49 is RB9
#define ECP23_TRIS    TRISBbits.TRISB9 // GPIO direction register bit
#define ECP23_WR      LATBbits.LATB9 // GPIO port latch register bit
#define ECP23_RD      PORTBbits.RB9 // GPIO port register bit
#define ECP23_ODC     ODCBbits.ODCB9 // GPIO port open drain configuration register bit
#define ECP23_CNPU    CNPUBbits.CNPUB9 // GPIO port pull-up resistor register bit
#define ECP23_CNPD    CNPDBbits.CNPDB9 // GPIO port pull-down resistor register bit
#define ECP23_CNEN0   CNEN0Bbits.CNEN0B9 // GPIO port change notification Enable register bit
#define ECP23_CNSTAT  CNSTATBbits.CNSTATB9 // GPIO port change notification Status register bit
#define ECP23_CNEN1   CNEN1Bbits.CNEN1B9 // GPIO port change notification Edge Select Enable register bit
#define ECP23_CNF     CNFBbits.CNFB9 // GPIO port change notification flag bit register bit
#define ECP23_RP      41 // Number of Remappable Pin
#define ECP23_SET     { asm volatile ("bset _LATB, #9 \n"); }
#define ECP23_CLEAR   { asm volatile ("bclr _LATB, #9 \n"); }
#define ECP23_TOGGLE  { asm volatile ("btg  _LATB, #9 \n"); }
#define ECP23_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP23_ANSEL   _ANSELB9 // analog/digital pin configuration register bit
#define ECP23_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP23_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP23_ADC_AN_INPUT 11   // ANx input pin number
#define ECP23_ADCBUF  ADCBUF11 // ADC buffer register for this input
#define ECP23_ADC_ANIE ADIELbits.IE11
#define ECP23_ADC_ANEIE ADEIELbits.EIEN11
#define ECP23_ADC_IF   _ADCAN11IF // interrupt flag bit
#define ECP23_ADC_IE   _ADCAN11IE // interrupt enable bit
#define ECP23_ADC_IP   _ADCAN11IP // interrupt priority for this analog input
#define ECP23_ADC_RDY  _AN11RDY // ADC buffer ready bit
#define _ECP23_ADC_Interrupt _ADCAN11Interrupt
#define ECP23_INIT_ANALOG	{ECP23_ANSEL = 1; ECP23_WR = PINSTATE_HIGH; ECP23_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP23_INIT_OUTPUT  {ECP23_WR = PINSTATE_LOW; ECP23_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP23_INIT_INPUT   {ECP23_WR = PINSTATE_HIGH; ECP23_TRIS = PINDIR_INPUT;} // initialization macro for digital input

