microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #36 is RC8
#define ECP24_TRIS    TRISCbits.TRISC8 // GPIO direction register bit
#define ECP24_WR      LATCbits.LATC8 // GPIO port latch register bit
#define ECP24_RD      PORTCbits.RC8 // GPIO port register bit
#define ECP24_ODC     ODCCbits.ODCC8 // GPIO port open drain configuration register bit
#define ECP24_CNPU    CNPUCbits.CNPUC8 // GPIO port pull-up resistor register bit
#define ECP24_CNPD    CNPDCbits.CNPDC8 // GPIO port pull-down resistor register bit
#define ECP24_CNEN0   CNEN0Cbits.CNEN0C8 // GPIO port change notification Enable register bit
#define ECP24_CNSTAT  CNSTATCbits.CNSTATC8 // GPIO port change notification Status register bit
#define ECP24_CNEN1   CNEN1Cbits.CNEN1C8 // GPIO port change notification Edge Select Enable register bit
#define ECP24_CNF     CNFCbits.CNFC8 // GPIO port change notification flag bit register bit
#define ECP24_RP      56 // Number of Remappable Pin
#define ECP24_SET     { asm volatile ("bset _LATC, #8 \n"); }
#define ECP24_CLEAR   { asm volatile ("bclr _LATC, #8 \n"); }
#define ECP24_TOGGLE  { asm volatile ("btg  _LATC, #8 \n"); }
#define ECP24_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP24_INIT_OUTPUT  {ECP24_WR = PINSTATE_LOW; ECP24_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP24_INIT_INPUT   {ECP24_WR = PINSTATE_HIGH; ECP24_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #52 is RC10
#define ECP25_TRIS    TRISCbits.TRISC10 // GPIO direction register bit
#define ECP25_WR      LATCbits.LATC10 // GPIO port latch register bit
#define ECP25_RD      PORTCbits.RC10 // GPIO port register bit
#define ECP25_ODC     ODCCbits.ODCC10 // GPIO port open drain configuration register bit
#define ECP25_CNPU    CNPUCbits.CNPUC10 // GPIO port pull-up resistor register bit
#define ECP25_CNPD    CNPDCbits.CNPDC10 // GPIO port pull-down resistor register bit
#define ECP25_CNEN0   CNEN0Cbits.CNEN0C10 // GPIO port change notification Enable register bit
#define ECP25_CNSTAT  CNSTATCbits.CNSTATC10 // GPIO port change notification Status register bit
#define ECP25_CNEN1   CNEN1Cbits.CNEN1C10 // GPIO port change notification Edge Select Enable register bit
#define ECP25_CNF     CNFCbits.CNFC10 // GPIO port change notification flag bit register bit
#define ECP25_RP      58 // Number of Remappable Pin
#define ECP25_SET     { asm volatile ("bset _LATC, #10 \n"); }
#define ECP25_CLEAR   { asm volatile ("bclr _LATC, #10 \n"); }
#define ECP25_TOGGLE  { asm volatile ("btg  _LATC, #10 \n"); }
#define ECP25_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP25_INIT_OUTPUT  {ECP25_WR = PINSTATE_LOW; ECP25_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP25_INIT_INPUT   {ECP25_WR = PINSTATE_HIGH; ECP25_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP25_PGx_CHANNEL  7 // PWM channel index
#define ECP25_PGx_PER      PG7PER // PWM channel period register
#define ECP25_PGx_PHASE    PG7PHASE // PWM channel phase register
#define ECP25_PGx_DC       PG7DC // PWM channel duty cycle register
#define ECP25_PGx_DCA      PG7DCA// PWM channel duty cycle A register
#define ECP25_PGx_DTH      PG7DTH // PWM channel rising edge dead time register
#define ECP25_PGx_DTL      PG7DTL // PWM channel falling edge dead time register
#define ECP25_PGx_OVRENH   PG7IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP25_PGx_PENH     PG7IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP25_PGxUPDREQ    PG7STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP25_PGxTRIGA     PG7TRIGA // PWM channel ADC trigger A register
#define ECP25_PGxTRIGB     PG7TRIGB // PWM channel ADC trigger A register
#define ECP25_PGxTRIGC     PG7TRIGC // PWM channel ADC trigger A register
#define ECP25_PWM_IF       _PWM7IF // interrupt flag bit
#define ECP25_PWM_IE       _PWM7IE // interrupt enable bit
#define ECP25_PWM_IP       _PWM7IP // interrupt priority for this analog input
#define _ECP25_PWM_Interrupt _PWM7Interrupt // Interrupt Service Routine name declaration

// Device Pin #11 is RD14
#define ECP26_TRIS    TRISDbits.TRISD14 // GPIO direction register bit
#define ECP26_WR      LATDbits.LATD14 // GPIO port latch register bit
#define ECP26_RD      PORTDbits.RD14 // GPIO port register bit
#define ECP26_ODC     ODCDbits.ODCD14 // GPIO port open drain configuration register bit
#define ECP26_CNPU    CNPUDbits.CNPUD14 // GPIO port pull-up resistor register bit
#define ECP26_CNPD    CNPDDbits.CNPDD14 // GPIO port pull-down resistor register bit
#define ECP26_CNEN0   CNEN0Dbits.CNEN0D14 // GPIO port change notification Enable register bit
#define ECP26_CNSTAT  CNSTATDbits.CNSTATD14 // GPIO port change notification Status register bit
#define ECP26_CNEN1   CNEN1Dbits.CNEN1D14 // GPIO port change notification Edge Select Enable register bit
#define ECP26_CNF     CNFDbits.CNFD14 // GPIO port change notification flag bit register bit
#define ECP26_RP      78 // Number of Remappable Pin
#define ECP26_SET     { asm volatile ("bset _LATD, #14 \n"); }
#define ECP26_CLEAR   { asm volatile ("bclr _LATD, #14 \n"); }
#define ECP26_TOGGLE  { asm volatile ("btg  _LATD, #14 \n"); }
#define ECP26_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP26_INIT_OUTPUT  {ECP26_WR = PINSTATE_LOW; ECP26_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP26_INIT_INPUT   {ECP26_WR = PINSTATE_HIGH; ECP26_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #53 is RC11
#define ECP27_TRIS    TRISCbits.TRISC11 // GPIO direction register bit
#define ECP27_WR      LATCbits.LATC11 // GPIO port latch register bit
#define ECP27_RD      PORTCbits.RC11 // GPIO port register bit
#define ECP27_ODC     ODCCbits.ODCC11 // GPIO port open drain configuration register bit
#define ECP27_CNPU    CNPUCbits.CNPUC11 // GPIO port pull-up resistor register bit
#define ECP27_CNPD    CNPDCbits.CNPDC11 // GPIO port pull-down resistor register bit
#define ECP27_CNEN0   CNEN0Cbits.CNEN0C11 // GPIO port change notification Enable register bit
#define ECP27_CNSTAT  CNSTATCbits.CNSTATC11 // GPIO port change notification Status register bit
#define ECP27_CNEN1   CNEN1Cbits.CNEN1C11 // GPIO port change notification Edge Select Enable register bit
#define ECP27_CNF     CNFCbits.CNFC11 // GPIO port change notification flag bit register bit
#define ECP27_RP      59 // Number of Remappable Pin
#define ECP27_SET     { asm volatile ("bset _LATC, #11 \n"); }
#define ECP27_CLEAR   { asm volatile ("bclr _LATC, #11 \n"); }
#define ECP27_TOGGLE  { asm volatile ("btg  _LATC, #11 \n"); }
#define ECP27_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP27_INIT_OUTPUT  {ECP27_WR = PINSTATE_LOW; ECP27_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP27_INIT_INPUT   {ECP27_WR = PINSTATE_HIGH; ECP27_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP27_PGx_CHANNEL  7 // PWM channel index
#define ECP27_PGx_PER      PG7PER // PWM channel period register
#define ECP27_PGx_PHASE    PG7PHASE // PWM channel phase register
#define ECP27_PGx_DC       PG7DC // PWM channel duty cycle register
#define ECP27_PGx_DCA      PG7DCA// PWM channel duty cycle A register
#define ECP27_PGx_DTH      PG7DTH // PWM channel rising edge dead time register
#define ECP27_PGx_DTL      PG7DTL // PWM channel falling edge dead time register
#define ECP27_PGx_OVRENL   PG7IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP27_PGx_PENL     PG7IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP27_PGxUPDREQ    PG7STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP27_PGxTRIGA     PG7TRIGA // PWM channel ADC trigger A register
#define ECP27_PGxTRIGB     PG7TRIGB // PWM channel ADC trigger A register
#define ECP27_PGxTRIGC     PG7TRIGC // PWM channel ADC trigger A register

// Device Pin #38 is RD9
#define ECP28_TRIS    TRISDbits.TRISD9 // GPIO direction register bit
#define ECP28_WR      LATDbits.LATD9 // GPIO port latch register bit
#define ECP28_RD      PORTDbits.RD9 // GPIO port register bit
#define ECP28_ODC     ODCDbits.ODCD9 // GPIO port open drain configuration register bit
#define ECP28_CNPU    CNPUDbits.CNPUD9 // GPIO port pull-up resistor register bit
#define ECP28_CNPD    CNPDDbits.CNPDD9 // GPIO port pull-down resistor register bit
#define ECP28_CNEN0   CNEN0Dbits.CNEN0D9 // GPIO port change notification Enable register bit
#define ECP28_CNSTAT  CNSTATDbits.CNSTATD9 // GPIO port change notification Status register bit
#define ECP28_CNEN1   CNEN1Dbits.CNEN1D9 // GPIO port change notification Edge Select Enable register bit
#define ECP28_CNF     CNFDbits.CNFD9 // GPIO port change notification flag bit register bit
#define ECP28_RP      73 // Number of Remappable Pin
#define ECP28_SET     { asm volatile ("bset _LATD, #9 \n"); }
#define ECP28_CLEAR   { asm volatile ("bclr _LATD, #9 \n"); }
#define ECP28_TOGGLE  { asm volatile ("btg  _LATD, #9 \n"); }
#define ECP28_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP28_INIT_OUTPUT  {ECP28_WR = PINSTATE_LOW; ECP28_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP28_INIT_INPUT   {ECP28_WR = PINSTATE_HIGH; ECP28_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #5 is RC14
#define ECP31_TRIS    TRISCbits.TRISC14 // GPIO direction register bit
#define ECP31_WR      LATCbits.LATC14 // GPIO port latch register bit
#define ECP31_RD      PORTCbits.RC14 // GPIO port register bit
#define ECP31_ODC     ODCCbits.ODCC14 // GPIO port open drain configuration register bit
#define ECP31_CNPU    CNPUCbits.CNPUC14 // GPIO port pull-up resistor register bit
#define ECP31_CNPD    CNPDCbits.CNPDC14 // GPIO port pull-down resistor register bit
#define ECP31_CNEN0   CNEN0Cbits.CNEN0C14 // GPIO port change notification Enable register bit
#define ECP31_CNSTAT  CNSTATCbits.CNSTATC14 // GPIO port change notification Status register bit
#define ECP31_CNEN1   CNEN1Cbits.CNEN1C14 // GPIO port change notification Edge Select Enable register bit
#define ECP31_CNF     CNFCbits.CNFC14 // GPIO port change notification flag bit register bit
#define ECP31_RP      62 // Number of Remappable Pin
#define ECP31_SET     { asm volatile ("bset _LATC, #14 \n"); }
#define ECP31_CLEAR   { asm volatile ("bclr _LATC, #14 \n"); }
#define ECP31_TOGGLE  { asm volatile ("btg  _LATC, #14 \n"); }
#define ECP31_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP31_INIT_OUTPUT  {ECP31_WR = PINSTATE_LOW; ECP31_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP31_INIT_INPUT   {ECP31_WR = PINSTATE_HIGH; ECP31_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP31_PGx_CHANNEL  6 // PWM channel index
#define ECP31_PGx_PER      PG6PER // PWM channel period register
#define ECP31_PGx_PHASE    PG6PHASE // PWM channel phase register
#define ECP31_PGx_DC       PG6DC // PWM channel duty cycle register
#define ECP31_PGx_DCA      PG6DCA// PWM channel duty cycle A register
#define ECP31_PGx_DTH      PG6DTH // PWM channel rising edge dead time register
#define ECP31_PGx_DTL      PG6DTL // PWM channel falling edge dead time register
#define ECP31_PGx_OVRENH   PG6IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP31_PGx_PENH     PG6IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP31_PGxUPDREQ    PG6STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP31_PGxTRIGA     PG6TRIGA // PWM channel ADC trigger A register
#define ECP31_PGxTRIGB     PG6TRIGB // PWM channel ADC trigger A register
#define ECP31_PGxTRIGC     PG6TRIGC // PWM channel ADC trigger A register
#define ECP31_PWM_IF       _PWM6IF // interrupt flag bit
#define ECP31_PWM_IE       _PWM6IE // interrupt enable bit
#define ECP31_PWM_IP       _PWM6IP // interrupt priority for this analog input
#define _ECP31_PWM_Interrupt _PWM6Interrupt // Interrupt Service Routine name declaration

