microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #37 is RC9
#define ECP32_TRIS    TRISCbits.TRISC9 // GPIO direction register bit
#define ECP32_WR      LATCbits.LATC9 // GPIO port latch register bit
#define ECP32_RD      PORTCbits.RC9 // GPIO port register bit
#define ECP32_ODC     ODCCbits.ODCC9 // GPIO port open drain configuration register bit
#define ECP32_CNPU    CNPUCbits.CNPUC9 // GPIO port pull-up resistor register bit
#define ECP32_CNPD    CNPDCbits.CNPDC9 // GPIO port pull-down resistor register bit
#define ECP32_CNEN0   CNEN0Cbits.CNEN0C9 // GPIO port change notification Enable register bit
#define ECP32_CNSTAT  CNSTATCbits.CNSTATC9 // GPIO port change notification Status register bit
#define ECP32_CNEN1   CNEN1Cbits.CNEN1C9 // GPIO port change notification Edge Select Enable register bit
#define ECP32_CNF     CNFCbits.CNFC9 // GPIO port change notification flag bit register bit
#define ECP32_RP      57 // Number of Remappable Pin
#define ECP32_SET     { asm volatile ("bset _LATC, #9 \n"); }
#define ECP32_CLEAR   { asm volatile ("bclr _LATC, #9 \n"); }
#define ECP32_TOGGLE  { asm volatile ("btg  _LATC, #9 \n"); }
#define ECP32_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP32_INIT_OUTPUT  {ECP32_WR = PINSTATE_LOW; ECP32_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP32_INIT_INPUT   {ECP32_WR = PINSTATE_HIGH; ECP32_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #6 is RC15
#define ECP33_TRIS    TRISCbits.TRISC15 // GPIO direction register bit
#define ECP33_WR      LATCbits.LATC15 // GPIO port latch register bit
#define ECP33_RD      PORTCbits.RC15 // GPIO port register bit
#define ECP33_ODC     ODCCbits.ODCC15 // GPIO port open drain configuration register bit
#define ECP33_CNPU    CNPUCbits.CNPUC15 // GPIO port pull-up resistor register bit
#define ECP33_CNPD    CNPDCbits.CNPDC15 // GPIO port pull-down resistor register bit
#define ECP33_CNEN0   CNEN0Cbits.CNEN0C15 // GPIO port change notification Enable register bit
#define ECP33_CNSTAT  CNSTATCbits.CNSTATC15 // GPIO port change notification Status register bit
#define ECP33_CNEN1   CNEN1Cbits.CNEN1C15 // GPIO port change notification Edge Select Enable register bit
#define ECP33_CNF     CNFCbits.CNFC15 // GPIO port change notification flag bit register bit
#define ECP33_RP      63 // Number of Remappable Pin
#define ECP33_SET     { asm volatile ("bset _LATC, #15 \n"); }
#define ECP33_CLEAR   { asm volatile ("bclr _LATC, #15 \n"); }
#define ECP33_TOGGLE  { asm volatile ("btg  _LATC, #15 \n"); }
#define ECP33_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP33_INIT_OUTPUT  {ECP33_WR = PINSTATE_LOW; ECP33_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP33_INIT_INPUT   {ECP33_WR = PINSTATE_HIGH; ECP33_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP33_PGx_CHANNEL  6 // PWM channel index
#define ECP33_PGx_PER      PG6PER // PWM channel period register
#define ECP33_PGx_PHASE    PG6PHASE // PWM channel phase register
#define ECP33_PGx_DC       PG6DC // PWM channel duty cycle register
#define ECP33_PGx_DCA      PG6DCA// PWM channel duty cycle A register
#define ECP33_PGx_DTH      PG6DTH // PWM channel rising edge dead time register
#define ECP33_PGx_DTL      PG6DTL // PWM channel falling edge dead time register
#define ECP33_PGx_OVRENL   PG6IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP33_PGx_PENL     PG6IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP33_PGxUPDREQ    PG6STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP33_PGxTRIGA     PG6TRIGA // PWM channel ADC trigger A register
#define ECP33_PGxTRIGB     PG6TRIGB // PWM channel ADC trigger A register
#define ECP33_PGxTRIGC     PG6TRIGC // PWM channel ADC trigger A register

// Device Pin #44 is RD5
#define ECP34_TRIS    TRISDbits.TRISD5 // GPIO direction register bit
#define ECP34_WR      LATDbits.LATD5 // GPIO port latch register bit
#define ECP34_RD      PORTDbits.RD5 // GPIO port register bit
#define ECP34_ODC     ODCDbits.ODCD5 // GPIO port open drain configuration register bit
#define ECP34_CNPU    CNPUDbits.CNPUD5 // GPIO port pull-up resistor register bit
#define ECP34_CNPD    CNPDDbits.CNPDD5 // GPIO port pull-down resistor register bit
#define ECP34_CNEN0   CNEN0Dbits.CNEN0D5 // GPIO port change notification Enable register bit
#define ECP34_CNSTAT  CNSTATDbits.CNSTATD5 // GPIO port change notification Status register bit
#define ECP34_CNEN1   CNEN1Dbits.CNEN1D5 // GPIO port change notification Edge Select Enable register bit
#define ECP34_CNF     CNFDbits.CNFD5 // GPIO port change notification flag bit register bit
#define ECP34_RP      69 // Number of Remappable Pin
#define ECP34_SET     { asm volatile ("bset _LATD, #5 \n"); }
#define ECP34_CLEAR   { asm volatile ("bclr _LATD, #5 \n"); }
#define ECP34_TOGGLE  { asm volatile ("btg  _LATD, #5 \n"); }
#define ECP34_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP34_INIT_OUTPUT  {ECP34_WR = PINSTATE_LOW; ECP34_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP34_INIT_INPUT   {ECP34_WR = PINSTATE_HIGH; ECP34_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #50 is RC4
#define ECP35_TRIS    TRISCbits.TRISC4 // GPIO direction register bit
#define ECP35_WR      LATCbits.LATC4 // GPIO port latch register bit
#define ECP35_RD      PORTCbits.RC4 // GPIO port register bit
#define ECP35_ODC     ODCCbits.ODCC4 // GPIO port open drain configuration register bit
#define ECP35_CNPU    CNPUCbits.CNPUC4 // GPIO port pull-up resistor register bit
#define ECP35_CNPD    CNPDCbits.CNPDC4 // GPIO port pull-down resistor register bit
#define ECP35_CNEN0   CNEN0Cbits.CNEN0C4 // GPIO port change notification Enable register bit
#define ECP35_CNSTAT  CNSTATCbits.CNSTATC4 // GPIO port change notification Status register bit
#define ECP35_CNEN1   CNEN1Cbits.CNEN1C4 // GPIO port change notification Edge Select Enable register bit
#define ECP35_CNF     CNFCbits.CNFC4 // GPIO port change notification flag bit register bit
#define ECP35_RP      52 // Number of Remappable Pin
#define ECP35_SET     { asm volatile ("bset _LATC, #4 \n"); }
#define ECP35_CLEAR   { asm volatile ("bclr _LATC, #4 \n"); }
#define ECP35_TOGGLE  { asm volatile ("btg  _LATC, #4 \n"); }
#define ECP35_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP35_INIT_OUTPUT  {ECP35_WR = PINSTATE_LOW; ECP35_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP35_INIT_INPUT   {ECP35_WR = PINSTATE_HIGH; ECP35_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP35_PGx_CHANNEL  5 // PWM channel index
#define ECP35_PGx_PER      PG5PER // PWM channel period register
#define ECP35_PGx_PHASE    PG5PHASE // PWM channel phase register
#define ECP35_PGx_DC       PG5DC // PWM channel duty cycle register
#define ECP35_PGx_DCA      PG5DCA// PWM channel duty cycle A register
#define ECP35_PGx_DTH      PG5DTH // PWM channel rising edge dead time register
#define ECP35_PGx_DTL      PG5DTL // PWM channel falling edge dead time register
#define ECP35_PGx_OVRENH   PG5IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP35_PGx_PENH     PG5IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP35_PGxUPDREQ    PG5STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP35_PGxTRIGA     PG5TRIGA // PWM channel ADC trigger A register
#define ECP35_PGxTRIGB     PG5TRIGB // PWM channel ADC trigger A register
#define ECP35_PGxTRIGC     PG5TRIGC // PWM channel ADC trigger A register
#define ECP35_PWM_IF       _PWM5IF // interrupt flag bit
#define ECP35_PWM_IE       _PWM5IE // interrupt enable bit
#define ECP35_PWM_IP       _PWM5IP // interrupt priority for this analog input
#define _ECP35_PWM_Interrupt _PWM5Interrupt // Interrupt Service Routine name declaration

// Device Pin #43 is RD6
#define ECP36_TRIS    TRISDbits.TRISD6 // GPIO direction register bit
#define ECP36_WR      LATDbits.LATD6 // GPIO port latch register bit
#define ECP36_RD      PORTDbits.RD6 // GPIO port register bit
#define ECP36_ODC     ODCDbits.ODCD6 // GPIO port open drain configuration register bit
#define ECP36_CNPU    CNPUDbits.CNPUD6 // GPIO port pull-up resistor register bit
#define ECP36_CNPD    CNPDDbits.CNPDD6 // GPIO port pull-down resistor register bit
#define ECP36_CNEN0   CNEN0Dbits.CNEN0D6 // GPIO port change notification Enable register bit
#define ECP36_CNSTAT  CNSTATDbits.CNSTATD6 // GPIO port change notification Status register bit
#define ECP36_CNEN1   CNEN1Dbits.CNEN1D6 // GPIO port change notification Edge Select Enable register bit
#define ECP36_CNF     CNFDbits.CNFD6 // GPIO port change notification flag bit register bit
#define ECP36_RP      70 // Number of Remappable Pin
#define ECP36_SET     { asm volatile ("bset _LATD, #6 \n"); }
#define ECP36_CLEAR   { asm volatile ("bclr _LATD, #6 \n"); }
#define ECP36_TOGGLE  { asm volatile ("btg  _LATD, #6 \n"); }
#define ECP36_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP36_INIT_OUTPUT  {ECP36_WR = PINSTATE_LOW; ECP36_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP36_INIT_INPUT   {ECP36_WR = PINSTATE_HIGH; ECP36_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #61 is RB10
#define ECP37_TRIS    TRISBbits.TRISB10 // GPIO direction register bit
#define ECP37_WR      LATBbits.LATB10 // GPIO port latch register bit
#define ECP37_RD      PORTBbits.RB10 // GPIO port register bit
#define ECP37_ODC     ODCBbits.ODCB10 // GPIO port open drain configuration register bit
#define ECP37_CNPU    CNPUBbits.CNPUB10 // GPIO port pull-up resistor register bit
#define ECP37_CNPD    CNPDBbits.CNPDB10 // GPIO port pull-down resistor register bit
#define ECP37_CNEN0   CNEN0Bbits.CNEN0B10 // GPIO port change notification Enable register bit
#define ECP37_CNSTAT  CNSTATBbits.CNSTATB10 // GPIO port change notification Status register bit
#define ECP37_CNEN1   CNEN1Bbits.CNEN1B10 // GPIO port change notification Edge Select Enable register bit
#define ECP37_CNF     CNFBbits.CNFB10 // GPIO port change notification flag bit register bit
#define ECP37_RP      42 // Number of Remappable Pin
#define ECP37_SET     { asm volatile ("bset _LATB, #10 \n"); }
#define ECP37_CLEAR   { asm volatile ("bclr _LATB, #10 \n"); }
#define ECP37_TOGGLE  { asm volatile ("btg  _LATB, #10 \n"); }
#define ECP37_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP37_INIT_OUTPUT  {ECP37_WR = PINSTATE_LOW; ECP37_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP37_INIT_INPUT   {ECP37_WR = PINSTATE_HIGH; ECP37_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP37_PGx_CHANNEL  3 // PWM channel index
#define ECP37_PGx_PER      PG3PER // PWM channel period register
#define ECP37_PGx_PHASE    PG3PHASE // PWM channel phase register
#define ECP37_PGx_DC       PG3DC // PWM channel duty cycle register
#define ECP37_PGx_DCA      PG3DCA// PWM channel duty cycle A register
#define ECP37_PGx_DTH      PG3DTH // PWM channel rising edge dead time register
#define ECP37_PGx_DTL      PG3DTL // PWM channel falling edge dead time register
#define ECP37_PGx_OVRENH   PG3IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP37_PGx_PENH     PG3IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP37_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP37_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
#define ECP37_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
#define ECP37_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register
#define ECP37_PWM_IF       _PWM3IF // interrupt flag bit
#define ECP37_PWM_IE       _PWM3IE // interrupt enable bit
#define ECP37_PWM_IP       _PWM3IP // interrupt priority for this analog input
#define _ECP37_PWM_Interrupt _PWM3Interrupt // Interrupt Service Routine name declaration

// Device Pin #51 is RC5
#define ECP38_TRIS    TRISCbits.TRISC5 // GPIO direction register bit
#define ECP38_WR      LATCbits.LATC5 // GPIO port latch register bit
#define ECP38_RD      PORTCbits.RC5 // GPIO port register bit
#define ECP38_ODC     ODCCbits.ODCC5 // GPIO port open drain configuration register bit
#define ECP38_CNPU    CNPUCbits.CNPUC5 // GPIO port pull-up resistor register bit
#define ECP38_CNPD    CNPDCbits.CNPDC5 // GPIO port pull-down resistor register bit
#define ECP38_CNEN0   CNEN0Cbits.CNEN0C5 // GPIO port change notification Enable register bit
#define ECP38_CNSTAT  CNSTATCbits.CNSTATC5 // GPIO port change notification Status register bit
#define ECP38_CNEN1   CNEN1Cbits.CNEN1C5 // GPIO port change notification Edge Select Enable register bit
#define ECP38_CNF     CNFCbits.CNFC5 // GPIO port change notification flag bit register bit
#define ECP38_RP      53 // Number of Remappable Pin
#define ECP38_SET     { asm volatile ("bset _LATC, #5 \n"); }
#define ECP38_CLEAR   { asm volatile ("bclr _LATC, #5 \n"); }
#define ECP38_TOGGLE  { asm volatile ("btg  _LATC, #5 \n"); }
#define ECP38_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP38_INIT_OUTPUT  {ECP38_WR = PINSTATE_LOW; ECP38_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP38_INIT_INPUT   {ECP38_WR = PINSTATE_HIGH; ECP38_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP38_PGx_CHANNEL  5 // PWM channel index
#define ECP38_PGx_PER      PG5PER // PWM channel period register
#define ECP38_PGx_PHASE    PG5PHASE // PWM channel phase register
#define ECP38_PGx_DC       PG5DC // PWM channel duty cycle register
#define ECP38_PGx_DCA      PG5DCA// PWM channel duty cycle A register
#define ECP38_PGx_DTH      PG5DTH // PWM channel rising edge dead time register
#define ECP38_PGx_DTL      PG5DTL // PWM channel falling edge dead time register
#define ECP38_PGx_OVRENL   PG5IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP38_PGx_PENL     PG5IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP38_PGxUPDREQ    PG5STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP38_PGxTRIGA     PG5TRIGA // PWM channel ADC trigger A register
#define ECP38_PGxTRIGB     PG5TRIGB // PWM channel ADC trigger A register
#define ECP38_PGxTRIGC     PG5TRIGC // PWM channel ADC trigger A register

// Device Pin #58 is RD2
#define ECP39_TRIS    TRISDbits.TRISD2 // GPIO direction register bit
#define ECP39_WR      LATDbits.LATD2 // GPIO port latch register bit
#define ECP39_RD      PORTDbits.RD2 // GPIO port register bit
#define ECP39_ODC     ODCDbits.ODCD2 // GPIO port open drain configuration register bit
#define ECP39_CNPU    CNPUDbits.CNPUD2 // GPIO port pull-up resistor register bit
#define ECP39_CNPD    CNPDDbits.CNPDD2 // GPIO port pull-down resistor register bit
#define ECP39_CNEN0   CNEN0Dbits.CNEN0D2 // GPIO port change notification Enable register bit
#define ECP39_CNSTAT  CNSTATDbits.CNSTATD2 // GPIO port change notification Status register bit
#define ECP39_CNEN1   CNEN1Dbits.CNEN1D2 // GPIO port change notification Edge Select Enable register bit
#define ECP39_CNF     CNFDbits.CNFD2 // GPIO port change notification flag bit register bit
#define ECP39_RP      66 // Number of Remappable Pin
#define ECP39_SET     { asm volatile ("bset _LATD, #2 \n"); }
#define ECP39_CLEAR   { asm volatile ("bclr _LATD, #2 \n"); }
#define ECP39_TOGGLE  { asm volatile ("btg  _LATD, #2 \n"); }
#define ECP39_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP39_INIT_OUTPUT  {ECP39_WR = PINSTATE_LOW; ECP39_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP39_INIT_INPUT   {ECP39_WR = PINSTATE_HIGH; ECP39_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #64 is RB13
#define ECP40_TRIS    TRISBbits.TRISB13 // GPIO direction register bit
#define ECP40_WR      LATBbits.LATB13 // GPIO port latch register bit
#define ECP40_RD      PORTBbits.RB13 // GPIO port register bit
#define ECP40_ODC     ODCBbits.ODCB13 // GPIO port open drain configuration register bit
#define ECP40_CNPU    CNPUBbits.CNPUB13 // GPIO port pull-up resistor register bit
#define ECP40_CNPD    CNPDBbits.CNPDB13 // GPIO port pull-down resistor register bit
#define ECP40_CNEN0   CNEN0Bbits.CNEN0B13 // GPIO port change notification Enable register bit
#define ECP40_CNSTAT  CNSTATBbits.CNSTATB13 // GPIO port change notification Status register bit
#define ECP40_CNEN1   CNEN1Bbits.CNEN1B13 // GPIO port change notification Edge Select Enable register bit
#define ECP40_CNF     CNFBbits.CNFB13 // GPIO port change notification flag bit register bit
#define ECP40_RP      45 // Number of Remappable Pin
#define ECP40_SET     { asm volatile ("bset _LATB, #13 \n"); }
#define ECP40_CLEAR   { asm volatile ("bclr _LATB, #13 \n"); }
#define ECP40_TOGGLE  { asm volatile ("btg  _LATB, #13 \n"); }
#define ECP40_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP40_INIT_OUTPUT  {ECP40_WR = PINSTATE_LOW; ECP40_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP40_INIT_INPUT   {ECP40_WR = PINSTATE_HIGH; ECP40_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP40_PGx_CHANNEL  2 // PWM channel index
#define ECP40_PGx_PER      PG2PER // PWM channel period register
#define ECP40_PGx_PHASE    PG2PHASE // PWM channel phase register
#define ECP40_PGx_DC       PG2DC // PWM channel duty cycle register
#define ECP40_PGx_DCA      PG2DCA// PWM channel duty cycle A register
#define ECP40_PGx_DTH      PG2DTH // PWM channel rising edge dead time register
#define ECP40_PGx_DTL      PG2DTL // PWM channel falling edge dead time register
#define ECP40_PGx_OVRENL   PG2IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP40_PGx_PENL     PG2IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP40_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP40_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
#define ECP40_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
#define ECP40_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register

// Device Pin #62 is RB11
#define ECP41_TRIS    TRISBbits.TRISB11 // GPIO direction register bit
#define ECP41_WR      LATBbits.LATB11 // GPIO port latch register bit
#define ECP41_RD      PORTBbits.RB11 // GPIO port register bit
#define ECP41_ODC     ODCBbits.ODCB11 // GPIO port open drain configuration register bit
#define ECP41_CNPU    CNPUBbits.CNPUB11 // GPIO port pull-up resistor register bit
#define ECP41_CNPD    CNPDBbits.CNPDB11 // GPIO port pull-down resistor register bit
#define ECP41_CNEN0   CNEN0Bbits.CNEN0B11 // GPIO port change notification Enable register bit
#define ECP41_CNSTAT  CNSTATBbits.CNSTATB11 // GPIO port change notification Status register bit
#define ECP41_CNEN1   CNEN1Bbits.CNEN1B11 // GPIO port change notification Edge Select Enable register bit
#define ECP41_CNF     CNFBbits.CNFB11 // GPIO port change notification flag bit register bit
#define ECP41_RP      43 // Number of Remappable Pin
#define ECP41_SET     { asm volatile ("bset _LATB, #11 \n"); }
#define ECP41_CLEAR   { asm volatile ("bclr _LATB, #11 \n"); }
#define ECP41_TOGGLE  { asm volatile ("btg  _LATB, #11 \n"); }
#define ECP41_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP41_INIT_OUTPUT  {ECP41_WR = PINSTATE_LOW; ECP41_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP41_INIT_INPUT   {ECP41_WR = PINSTATE_HIGH; ECP41_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP41_PGx_CHANNEL  3 // PWM channel index
#define ECP41_PGx_PER      PG3PER // PWM channel period register
#define ECP41_PGx_PHASE    PG3PHASE // PWM channel phase register
#define ECP41_PGx_DC       PG3DC // PWM channel duty cycle register
#define ECP41_PGx_DCA      PG3DCA// PWM channel duty cycle A register
#define ECP41_PGx_DTH      PG3DTH // PWM channel rising edge dead time register
#define ECP41_PGx_DTL      PG3DTL // PWM channel falling edge dead time register
#define ECP41_PGx_OVRENL   PG3IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP41_PGx_PENL     PG3IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP41_PGxUPDREQ    PG3STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP41_PGxTRIGA     PG3TRIGA // PWM channel ADC trigger A register
#define ECP41_PGxTRIGB     PG3TRIGB // PWM channel ADC trigger A register
#define ECP41_PGxTRIGC     PG3TRIGC // PWM channel ADC trigger A register

