microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #63 is RB12
#define ECP42_TRIS    TRISBbits.TRISB12 // GPIO direction register bit
#define ECP42_WR      LATBbits.LATB12 // GPIO port latch register bit
#define ECP42_RD      PORTBbits.RB12 // GPIO port register bit
#define ECP42_ODC     ODCBbits.ODCB12 // GPIO port open drain configuration register bit
#define ECP42_CNPU    CNPUBbits.CNPUB12 // GPIO port pull-up resistor register bit
#define ECP42_CNPD    CNPDBbits.CNPDB12 // GPIO port pull-down resistor register bit
#define ECP42_CNEN0   CNEN0Bbits.CNEN0B12 // GPIO port change notification Enable register bit
#define ECP42_CNSTAT  CNSTATBbits.CNSTATB12 // GPIO port change notification Status register bit
#define ECP42_CNEN1   CNEN1Bbits.CNEN1B12 // GPIO port change notification Edge Select Enable register bit
#define ECP42_CNF     CNFBbits.CNFB12 // GPIO port change notification flag bit register bit
#define ECP42_RP      44 // Number of Remappable Pin
#define ECP42_SET     { asm volatile ("bset _LATB, #12 \n"); }
#define ECP42_CLEAR   { asm volatile ("bclr _LATB, #12 \n"); }
#define ECP42_TOGGLE  { asm volatile ("btg  _LATB, #12 \n"); }
#define ECP42_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP42_INIT_OUTPUT  {ECP42_WR = PINSTATE_LOW; ECP42_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP42_INIT_INPUT   {ECP42_WR = PINSTATE_HIGH; ECP42_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP42_PGx_CHANNEL  2 // PWM channel index
#define ECP42_PGx_PER      PG2PER // PWM channel period register
#define ECP42_PGx_PHASE    PG2PHASE // PWM channel phase register
#define ECP42_PGx_DC       PG2DC // PWM channel duty cycle register
#define ECP42_PGx_DCA      PG2DCA// PWM channel duty cycle A register
#define ECP42_PGx_DTH      PG2DTH // PWM channel rising edge dead time register
#define ECP42_PGx_DTL      PG2DTL // PWM channel falling edge dead time register
#define ECP42_PGx_OVRENH   PG2IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP42_PGx_PENH     PG2IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP42_PGxUPDREQ    PG2STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP42_PGxTRIGA     PG2TRIGA // PWM channel ADC trigger A register
#define ECP42_PGxTRIGB     PG2TRIGB // PWM channel ADC trigger A register
#define ECP42_PGxTRIGC     PG2TRIGC // PWM channel ADC trigger A register
#define ECP42_PWM_IF       _PWM2IF // interrupt flag bit
#define ECP42_PWM_IE       _PWM2IE // interrupt enable bit
#define ECP42_PWM_IP       _PWM2IP // interrupt priority for this analog input
#define _ECP42_PWM_Interrupt _PWM2Interrupt // Interrupt Service Routine name declaration

// Device Pin #59 is RD1
#define ECP43_TRIS    TRISDbits.TRISD1 // GPIO direction register bit
#define ECP43_WR      LATDbits.LATD1 // GPIO port latch register bit
#define ECP43_RD      PORTDbits.RD1 // GPIO port register bit
#define ECP43_ODC     ODCDbits.ODCD1 // GPIO port open drain configuration register bit
#define ECP43_CNPU    CNPUDbits.CNPUD1 // GPIO port pull-up resistor register bit
#define ECP43_CNPD    CNPDDbits.CNPDD1 // GPIO port pull-down resistor register bit
#define ECP43_CNEN0   CNEN0Dbits.CNEN0D1 // GPIO port change notification Enable register bit
#define ECP43_CNSTAT  CNSTATDbits.CNSTATD1 // GPIO port change notification Status register bit
#define ECP43_CNEN1   CNEN1Dbits.CNEN1D1 // GPIO port change notification Edge Select Enable register bit
#define ECP43_CNF     CNFDbits.CNFD1 // GPIO port change notification flag bit register bit
#define ECP43_RP      65 // Number of Remappable Pin
#define ECP43_SET     { asm volatile ("bset _LATD, #1 \n"); }
#define ECP43_CLEAR   { asm volatile ("bclr _LATD, #1 \n"); }
#define ECP43_TOGGLE  { asm volatile ("btg  _LATD, #1 \n"); }
#define ECP43_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP43_INIT_OUTPUT  {ECP43_WR = PINSTATE_LOW; ECP43_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP43_INIT_INPUT   {ECP43_WR = PINSTATE_HIGH; ECP43_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP43_PGx_CHANNEL  4 // PWM channel index
#define ECP43_PGx_PER      PG4PER // PWM channel period register
#define ECP43_PGx_PHASE    PG4PHASE // PWM channel phase register
#define ECP43_PGx_DC       PG4DC // PWM channel duty cycle register
#define ECP43_PGx_DCA      PG4DCA// PWM channel duty cycle A register
#define ECP43_PGx_DTH      PG4DTH // PWM channel rising edge dead time register
#define ECP43_PGx_DTL      PG4DTL // PWM channel falling edge dead time register
#define ECP43_PGx_OVRENH   PG4IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP43_PGx_PENH     PG4IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP43_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP43_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
#define ECP43_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
#define ECP43_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register
#define ECP43_PWM_IF       _PWM4IF // interrupt flag bit
#define ECP43_PWM_IE       _PWM4IE // interrupt enable bit
#define ECP43_PWM_IP       _PWM4IP // interrupt priority for this analog input
#define _ECP43_PWM_Interrupt _PWM4Interrupt // Interrupt Service Routine name declaration

// Device Pin #60 is RD0
#define ECP44_TRIS    TRISDbits.TRISD0 // GPIO direction register bit
#define ECP44_WR      LATDbits.LATD0 // GPIO port latch register bit
#define ECP44_RD      PORTDbits.RD0 // GPIO port register bit
#define ECP44_ODC     ODCDbits.ODCD0 // GPIO port open drain configuration register bit
#define ECP44_CNPU    CNPUDbits.CNPUD0 // GPIO port pull-up resistor register bit
#define ECP44_CNPD    CNPDDbits.CNPDD0 // GPIO port pull-down resistor register bit
#define ECP44_CNEN0   CNEN0Dbits.CNEN0D0 // GPIO port change notification Enable register bit
#define ECP44_CNSTAT  CNSTATDbits.CNSTATD0 // GPIO port change notification Status register bit
#define ECP44_CNEN1   CNEN1Dbits.CNEN1D0 // GPIO port change notification Edge Select Enable register bit
#define ECP44_CNF     CNFDbits.CNFD0 // GPIO port change notification flag bit register bit
#define ECP44_RP      64 // Number of Remappable Pin
#define ECP44_SET     { asm volatile ("bset _LATD, #0 \n"); }
#define ECP44_CLEAR   { asm volatile ("bclr _LATD, #0 \n"); }
#define ECP44_TOGGLE  { asm volatile ("btg  _LATD, #0 \n"); }
#define ECP44_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP44_INIT_OUTPUT  {ECP44_WR = PINSTATE_LOW; ECP44_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP44_INIT_INPUT   {ECP44_WR = PINSTATE_HIGH; ECP44_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP44_PGx_CHANNEL  4 // PWM channel index
#define ECP44_PGx_PER      PG4PER // PWM channel period register
#define ECP44_PGx_PHASE    PG4PHASE // PWM channel phase register
#define ECP44_PGx_DC       PG4DC // PWM channel duty cycle register
#define ECP44_PGx_DCA      PG4DCA// PWM channel duty cycle A register
#define ECP44_PGx_DTH      PG4DTH // PWM channel rising edge dead time register
#define ECP44_PGx_DTL      PG4DTL // PWM channel falling edge dead time register
#define ECP44_PGx_OVRENL   PG4IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP44_PGx_PENL     PG4IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP44_PGxUPDREQ    PG4STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP44_PGxTRIGA     PG4TRIGA // PWM channel ADC trigger A register
#define ECP44_PGxTRIGB     PG4TRIGB // PWM channel ADC trigger A register
#define ECP44_PGxTRIGC     PG4TRIGC // PWM channel ADC trigger A register

// Device Pin #1 is RB14
#define ECP45_TRIS    TRISBbits.TRISB14 // GPIO direction register bit
#define ECP45_WR      LATBbits.LATB14 // GPIO port latch register bit
#define ECP45_RD      PORTBbits.RB14 // GPIO port register bit
#define ECP45_ODC     ODCBbits.ODCB14 // GPIO port open drain configuration register bit
#define ECP45_CNPU    CNPUBbits.CNPUB14 // GPIO port pull-up resistor register bit
#define ECP45_CNPD    CNPDBbits.CNPDB14 // GPIO port pull-down resistor register bit
#define ECP45_CNEN0   CNEN0Bbits.CNEN0B14 // GPIO port change notification Enable register bit
#define ECP45_CNSTAT  CNSTATBbits.CNSTATB14 // GPIO port change notification Status register bit
#define ECP45_CNEN1   CNEN1Bbits.CNEN1B14 // GPIO port change notification Edge Select Enable register bit
#define ECP45_CNF     CNFBbits.CNFB14 // GPIO port change notification flag bit register bit
#define ECP45_RP      46 // Number of Remappable Pin
#define ECP45_SET     { asm volatile ("bset _LATB, #14 \n"); }
#define ECP45_CLEAR   { asm volatile ("bclr _LATB, #14 \n"); }
#define ECP45_TOGGLE  { asm volatile ("btg  _LATB, #14 \n"); }
#define ECP45_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP45_INIT_OUTPUT  {ECP45_WR = PINSTATE_LOW; ECP45_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP45_INIT_INPUT   {ECP45_WR = PINSTATE_HIGH; ECP45_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP45_PGx_CHANNEL  1 // PWM channel index
#define ECP45_PGx_PER      PG1PER // PWM channel period register
#define ECP45_PGx_PHASE    PG1PHASE // PWM channel phase register
#define ECP45_PGx_DC       PG1DC // PWM channel duty cycle register
#define ECP45_PGx_DCA      PG1DCA// PWM channel duty cycle A register
#define ECP45_PGx_DTH      PG1DTH // PWM channel rising edge dead time register
#define ECP45_PGx_DTL      PG1DTL // PWM channel falling edge dead time register
#define ECP45_PGx_OVRENH   PG1IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP45_PGx_PENH     PG1IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP45_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP45_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
#define ECP45_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
#define ECP45_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register
#define ECP45_PWM_IF       _PWM1IF // interrupt flag bit
#define ECP45_PWM_IE       _PWM1IE // interrupt enable bit
#define ECP45_PWM_IP       _PWM1IP // interrupt priority for this analog input
#define _ECP45_PWM_Interrupt _PWM1Interrupt // Interrupt Service Routine name declaration

// Device Pin #3 is RC12
#define ECP46_TRIS    TRISCbits.TRISC12 // GPIO direction register bit
#define ECP46_WR      LATCbits.LATC12 // GPIO port latch register bit
#define ECP46_RD      PORTCbits.RC12 // GPIO port register bit
#define ECP46_ODC     ODCCbits.ODCC12 // GPIO port open drain configuration register bit
#define ECP46_CNPU    CNPUCbits.CNPUC12 // GPIO port pull-up resistor register bit
#define ECP46_CNPD    CNPDCbits.CNPDC12 // GPIO port pull-down resistor register bit
#define ECP46_CNEN0   CNEN0Cbits.CNEN0C12 // GPIO port change notification Enable register bit
#define ECP46_CNSTAT  CNSTATCbits.CNSTATC12 // GPIO port change notification Status register bit
#define ECP46_CNEN1   CNEN1Cbits.CNEN1C12 // GPIO port change notification Edge Select Enable register bit
#define ECP46_CNF     CNFCbits.CNFC12 // GPIO port change notification flag bit register bit
#define ECP46_RP      60 // Number of Remappable Pin
#define ECP46_SET     { asm volatile ("bset _LATC, #12 \n"); }
#define ECP46_CLEAR   { asm volatile ("bclr _LATC, #12 \n"); }
#define ECP46_TOGGLE  { asm volatile ("btg  _LATC, #12 \n"); }
#define ECP46_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP46_INIT_OUTPUT  {ECP46_WR = PINSTATE_LOW; ECP46_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP46_INIT_INPUT   {ECP46_WR = PINSTATE_HIGH; ECP46_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP46_PGx_CHANNEL  8 // PWM channel index
#define ECP46_PGx_PER      PG8PER // PWM channel period register
#define ECP46_PGx_PHASE    PG8PHASE // PWM channel phase register
#define ECP46_PGx_DC       PG8DC // PWM channel duty cycle register
#define ECP46_PGx_DCA      PG8DCA// PWM channel duty cycle A register
#define ECP46_PGx_DTH      PG8DTH // PWM channel rising edge dead time register
#define ECP46_PGx_DTL      PG8DTL // PWM channel falling edge dead time register
#define ECP46_PGx_OVRENH   PG8IOCONLbits.OVRENH // PWM channel IO config register override high control bit
#define ECP46_PGx_PENH     PG8IOCONLbits.PENH // PWM channel IO config register pin enable high control bit
#define ECP46_PGxUPDREQ    PG8STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP46_PGxTRIGA     PG8TRIGA // PWM channel ADC trigger A register
#define ECP46_PGxTRIGB     PG8TRIGB // PWM channel ADC trigger A register
#define ECP46_PGxTRIGC     PG8TRIGC // PWM channel ADC trigger A register
#define ECP46_PWM_IF       _PWM8IF // interrupt flag bit
#define ECP46_PWM_IE       _PWM8IE // interrupt enable bit
#define ECP46_PWM_IP       _PWM8IP // interrupt priority for this analog input
#define _ECP46_PWM_Interrupt _PWM8Interrupt // Interrupt Service Routine name declaration

// Device Pin #2 is RB15
#define ECP47_TRIS    TRISBbits.TRISB15 // GPIO direction register bit
#define ECP47_WR      LATBbits.LATB15 // GPIO port latch register bit
#define ECP47_RD      PORTBbits.RB15 // GPIO port register bit
#define ECP47_ODC     ODCBbits.ODCB15 // GPIO port open drain configuration register bit
#define ECP47_CNPU    CNPUBbits.CNPUB15 // GPIO port pull-up resistor register bit
#define ECP47_CNPD    CNPDBbits.CNPDB15 // GPIO port pull-down resistor register bit
#define ECP47_CNEN0   CNEN0Bbits.CNEN0B15 // GPIO port change notification Enable register bit
#define ECP47_CNSTAT  CNSTATBbits.CNSTATB15 // GPIO port change notification Status register bit
#define ECP47_CNEN1   CNEN1Bbits.CNEN1B15 // GPIO port change notification Edge Select Enable register bit
#define ECP47_CNF     CNFBbits.CNFB15 // GPIO port change notification flag bit register bit
#define ECP47_RP      47 // Number of Remappable Pin
#define ECP47_SET     { asm volatile ("bset _LATB, #15 \n"); }
#define ECP47_CLEAR   { asm volatile ("bclr _LATB, #15 \n"); }
#define ECP47_TOGGLE  { asm volatile ("btg  _LATB, #15 \n"); }
#define ECP47_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP47_INIT_OUTPUT  {ECP47_WR = PINSTATE_LOW; ECP47_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP47_INIT_INPUT   {ECP47_WR = PINSTATE_HIGH; ECP47_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP47_PGx_CHANNEL  1 // PWM channel index
#define ECP47_PGx_PER      PG1PER // PWM channel period register
#define ECP47_PGx_PHASE    PG1PHASE // PWM channel phase register
#define ECP47_PGx_DC       PG1DC // PWM channel duty cycle register
#define ECP47_PGx_DCA      PG1DCA// PWM channel duty cycle A register
#define ECP47_PGx_DTH      PG1DTH // PWM channel rising edge dead time register
#define ECP47_PGx_DTL      PG1DTL // PWM channel falling edge dead time register
#define ECP47_PGx_OVRENL   PG1IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP47_PGx_PENL     PG1IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP47_PGxUPDREQ    PG1STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP47_PGxTRIGA     PG1TRIGA // PWM channel ADC trigger A register
#define ECP47_PGxTRIGB     PG1TRIGB // PWM channel ADC trigger A register
#define ECP47_PGxTRIGC     PG1TRIGC // PWM channel ADC trigger A register

// Device Pin #4 is RC13
#define ECP48_TRIS    TRISCbits.TRISC13 // GPIO direction register bit
#define ECP48_WR      LATCbits.LATC13 // GPIO port latch register bit
#define ECP48_RD      PORTCbits.RC13 // GPIO port register bit
#define ECP48_ODC     ODCCbits.ODCC13 // GPIO port open drain configuration register bit
#define ECP48_CNPU    CNPUCbits.CNPUC13 // GPIO port pull-up resistor register bit
#define ECP48_CNPD    CNPDCbits.CNPDC13 // GPIO port pull-down resistor register bit
#define ECP48_CNEN0   CNEN0Cbits.CNEN0C13 // GPIO port change notification Enable register bit
#define ECP48_CNSTAT  CNSTATCbits.CNSTATC13 // GPIO port change notification Status register bit
#define ECP48_CNEN1   CNEN1Cbits.CNEN1C13 // GPIO port change notification Edge Select Enable register bit
#define ECP48_CNF     CNFCbits.CNFC13 // GPIO port change notification flag bit register bit
#define ECP48_RP      61 // Number of Remappable Pin
#define ECP48_SET     { asm volatile ("bset _LATC, #13 \n"); }
#define ECP48_CLEAR   { asm volatile ("bclr _LATC, #13 \n"); }
#define ECP48_TOGGLE  { asm volatile ("btg  _LATC, #13 \n"); }
#define ECP48_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP48_INIT_OUTPUT  {ECP48_WR = PINSTATE_LOW; ECP48_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP48_INIT_INPUT   {ECP48_WR = PINSTATE_HIGH; ECP48_TRIS = PINDIR_INPUT;} // initialization macro for digital input
#define ECP48_PGx_CHANNEL  8 // PWM channel index
#define ECP48_PGx_PER      PG8PER // PWM channel period register
#define ECP48_PGx_PHASE    PG8PHASE // PWM channel phase register
#define ECP48_PGx_DC       PG8DC // PWM channel duty cycle register
#define ECP48_PGx_DCA      PG8DCA// PWM channel duty cycle A register
#define ECP48_PGx_DTH      PG8DTH // PWM channel rising edge dead time register
#define ECP48_PGx_DTL      PG8DTL // PWM channel falling edge dead time register
#define ECP48_PGx_OVRENL   PG8IOCONLbits.OVRENL // PWM channel IO config register override low control bit
#define ECP48_PGx_PENL     PG8IOCONLbits.PENL // PWM channel IO config register pin enable low control bit
#define ECP48_PGxUPDREQ    PG8STATbits.UPDREQ // PWM channel ADC trigger A register
#define ECP48_PGxTRIGA     PG8TRIGA // PWM channel ADC trigger A register
#define ECP48_PGxTRIGB     PG8TRIGB // PWM channel ADC trigger A register
#define ECP48_PGxTRIGC     PG8TRIGC // PWM channel ADC trigger A register

// Device Pin #42 is RD7
#define ECP50_TRIS    TRISDbits.TRISD7 // GPIO direction register bit
#define ECP50_WR      LATDbits.LATD7 // GPIO port latch register bit
#define ECP50_RD      PORTDbits.RD7 // GPIO port register bit
#define ECP50_ODC     ODCDbits.ODCD7 // GPIO port open drain configuration register bit
#define ECP50_CNPU    CNPUDbits.CNPUD7 // GPIO port pull-up resistor register bit
#define ECP50_CNPD    CNPDDbits.CNPDD7 // GPIO port pull-down resistor register bit
#define ECP50_CNEN0   CNEN0Dbits.CNEN0D7 // GPIO port change notification Enable register bit
#define ECP50_CNSTAT  CNSTATDbits.CNSTATD7 // GPIO port change notification Status register bit
#define ECP50_CNEN1   CNEN1Dbits.CNEN1D7 // GPIO port change notification Edge Select Enable register bit
#define ECP50_CNF     CNFDbits.CNFD7 // GPIO port change notification flag bit register bit
#define ECP50_RP      71 // Number of Remappable Pin
#define ECP50_SET     { asm volatile ("bset _LATD, #7 \n"); }
#define ECP50_CLEAR   { asm volatile ("bclr _LATD, #7 \n"); }
#define ECP50_TOGGLE  { asm volatile ("btg  _LATD, #7 \n"); }
#define ECP50_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP50_INIT_OUTPUT  {ECP50_WR = PINSTATE_LOW; ECP50_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP50_INIT_INPUT   {ECP50_WR = PINSTATE_HIGH; ECP50_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #35 is RB4
#define ECP51_TRIS    TRISBbits.TRISB4 // GPIO direction register bit
#define ECP51_WR      LATBbits.LATB4 // GPIO port latch register bit
#define ECP51_RD      PORTBbits.RB4 // GPIO port register bit
#define ECP51_ODC     ODCBbits.ODCB4 // GPIO port open drain configuration register bit
#define ECP51_CNPU    CNPUBbits.CNPUB4 // GPIO port pull-up resistor register bit
#define ECP51_CNPD    CNPDBbits.CNPDB4 // GPIO port pull-down resistor register bit
#define ECP51_CNEN0   CNEN0Bbits.CNEN0B4 // GPIO port change notification Enable register bit
#define ECP51_CNSTAT  CNSTATBbits.CNSTATB4 // GPIO port change notification Status register bit
#define ECP51_CNEN1   CNEN1Bbits.CNEN1B4 // GPIO port change notification Edge Select Enable register bit
#define ECP51_CNF     CNFBbits.CNFB4 // GPIO port change notification flag bit register bit
#define ECP51_RP      36 // Number of Remappable Pin
#define ECP51_SET     { asm volatile ("bset _LATB, #4 \n"); }
#define ECP51_CLEAR   { asm volatile ("bclr _LATB, #4 \n"); }
#define ECP51_TOGGLE  { asm volatile ("btg  _LATB, #4 \n"); }
#define ECP51_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP51_INIT_OUTPUT  {ECP51_WR = PINSTATE_LOW; ECP51_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP51_INIT_INPUT   {ECP51_WR = PINSTATE_HIGH; ECP51_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #39 is RD8
#define ECP52_TRIS    TRISDbits.TRISD8 // GPIO direction register bit
#define ECP52_WR      LATDbits.LATD8 // GPIO port latch register bit
#define ECP52_RD      PORTDbits.RD8 // GPIO port register bit
#define ECP52_ODC     ODCDbits.ODCD8 // GPIO port open drain configuration register bit
#define ECP52_CNPU    CNPUDbits.CNPUD8 // GPIO port pull-up resistor register bit
#define ECP52_CNPD    CNPDDbits.CNPDD8 // GPIO port pull-down resistor register bit
#define ECP52_CNEN0   CNEN0Dbits.CNEN0D8 // GPIO port change notification Enable register bit
#define ECP52_CNSTAT  CNSTATDbits.CNSTATD8 // GPIO port change notification Status register bit
#define ECP52_CNEN1   CNEN1Dbits.CNEN1D8 // GPIO port change notification Edge Select Enable register bit
#define ECP52_CNF     CNFDbits.CNFD8 // GPIO port change notification flag bit register bit
#define ECP52_RP      72 // Number of Remappable Pin
#define ECP52_SET     { asm volatile ("bset _LATD, #8 \n"); }
#define ECP52_CLEAR   { asm volatile ("bclr _LATD, #8 \n"); }
#define ECP52_TOGGLE  { asm volatile ("btg  _LATD, #8 \n"); }
#define ECP52_IS_ANALOG_INPUT  0 // Pin is/is not analog input 
#define ECP52_INIT_OUTPUT  {ECP52_WR = PINSTATE_LOW; ECP52_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP52_INIT_INPUT   {ECP52_WR = PINSTATE_HIGH; ECP52_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #46 is RB6
#define ECP53_TRIS    TRISBbits.TRISB6 // GPIO direction register bit
#define ECP53_WR      LATBbits.LATB6 // GPIO port latch register bit
#define ECP53_RD      PORTBbits.RB6 // GPIO port register bit
#define ECP53_ODC     ODCBbits.ODCB6 // GPIO port open drain configuration register bit
#define ECP53_CNPU    CNPUBbits.CNPUB6 // GPIO port pull-up resistor register bit
#define ECP53_CNPD    CNPDBbits.CNPDB6 // GPIO port pull-down resistor register bit
#define ECP53_CNEN0   CNEN0Bbits.CNEN0B6 // GPIO port change notification Enable register bit
#define ECP53_CNSTAT  CNSTATBbits.CNSTATB6 // GPIO port change notification Status register bit
#define ECP53_CNEN1   CNEN1Bbits.CNEN1B6 // GPIO port change notification Edge Select Enable register bit
#define ECP53_CNF     CNFBbits.CNFB6 // GPIO port change notification flag bit register bit
#define ECP53_RP      38 // Number of Remappable Pin
#define ECP53_SET     { asm volatile ("bset _LATB, #6 \n"); }
#define ECP53_CLEAR   { asm volatile ("bclr _LATB, #6 \n"); }
#define ECP53_TOGGLE  { asm volatile ("btg  _LATB, #6 \n"); }
#define ECP53_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define ECP53_INIT_OUTPUT  {ECP53_WR = PINSTATE_LOW; ECP53_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP53_INIT_INPUT   {ECP53_WR = PINSTATE_HIGH; ECP53_TRIS = PINDIR_INPUT;} // initialization macro for digital input

