microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #12 is RD13
#define ECP54_TRIS    TRISDbits.TRISD13 // GPIO direction register bit
#define ECP54_WR      LATDbits.LATD13 // GPIO port latch register bit
#define ECP54_RD      PORTDbits.RD13 // GPIO port register bit
#define ECP54_ODC     ODCDbits.ODCD13 // GPIO port open drain configuration register bit
#define ECP54_CNPU    CNPUDbits.CNPUD13 // GPIO port pull-up resistor register bit
#define ECP54_CNPD    CNPDDbits.CNPDD13 // GPIO port pull-down resistor register bit
#define ECP54_CNEN0   CNEN0Dbits.CNEN0D13 // GPIO port change notification Enable register bit
#define ECP54_CNSTAT  CNSTATDbits.CNSTATD13 // GPIO port change notification Status register bit
#define ECP54_CNEN1   CNEN1Dbits.CNEN1D13 // GPIO port change notification Edge Select Enable register bit
#define ECP54_CNF     CNFDbits.CNFD13 // GPIO port change notification flag bit register bit
#define ECP54_RP      77 // Number of Remappable Pin
#define ECP54_SET     { asm volatile ("bset _LATD, #13 \n"); }
#define ECP54_CLEAR   { asm volatile ("bclr _LATD, #13 \n"); }
#define ECP54_TOGGLE  { asm volatile ("btg  _LATD, #13 \n"); }
#define ECP54_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define ECP54_INIT_OUTPUT  {ECP54_WR = PINSTATE_LOW; ECP54_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP54_INIT_INPUT   {ECP54_WR = PINSTATE_HIGH; ECP54_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #45 is RB5
#define ECP55_TRIS    TRISBbits.TRISB5 // GPIO direction register bit
#define ECP55_WR      LATBbits.LATB5 // GPIO port latch register bit
#define ECP55_RD      PORTBbits.RB5 // GPIO port register bit
#define ECP55_ODC     ODCBbits.ODCB5 // GPIO port open drain configuration register bit
#define ECP55_CNPU    CNPUBbits.CNPUB5 // GPIO port pull-up resistor register bit
#define ECP55_CNPD    CNPDBbits.CNPDB5 // GPIO port pull-down resistor register bit
#define ECP55_CNEN0   CNEN0Bbits.CNEN0B5 // GPIO port change notification Enable register bit
#define ECP55_CNSTAT  CNSTATBbits.CNSTATB5 // GPIO port change notification Status register bit
#define ECP55_CNEN1   CNEN1Bbits.CNEN1B5 // GPIO port change notification Edge Select Enable register bit
#define ECP55_CNF     CNFBbits.CNFB5 // GPIO port change notification flag bit register bit
#define ECP55_RP      37 // Number of Remappable Pin
#define ECP55_SET     { asm volatile ("bset _LATB, #5 \n"); }
#define ECP55_CLEAR   { asm volatile ("bclr _LATB, #5 \n"); }
#define ECP55_TOGGLE  { asm volatile ("btg  _LATB, #5 \n"); }
#define ECP55_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define ECP55_INIT_OUTPUT  {ECP55_WR = PINSTATE_LOW; ECP55_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP55_INIT_INPUT   {ECP55_WR = PINSTATE_HIGH; ECP55_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #34 is RB3
#define ECP56_TRIS    TRISBbits.TRISB3 // GPIO direction register bit
#define ECP56_WR      LATBbits.LATB3 // GPIO port latch register bit
#define ECP56_RD      PORTBbits.RB3 // GPIO port register bit
#define ECP56_ODC     ODCBbits.ODCB3 // GPIO port open drain configuration register bit
#define ECP56_CNPU    CNPUBbits.CNPUB3 // GPIO port pull-up resistor register bit
#define ECP56_CNPD    CNPDBbits.CNPDB3 // GPIO port pull-down resistor register bit
#define ECP56_CNEN0   CNEN0Bbits.CNEN0B3 // GPIO port change notification Enable register bit
#define ECP56_CNSTAT  CNSTATBbits.CNSTATB3 // GPIO port change notification Status register bit
#define ECP56_CNEN1   CNEN1Bbits.CNEN1B3 // GPIO port change notification Edge Select Enable register bit
#define ECP56_CNF     CNFBbits.CNFB3 // GPIO port change notification flag bit register bit
#define ECP56_RP      35 // Number of Remappable Pin
#define ECP56_SET     { asm volatile ("bset _LATB, #3 \n"); }
#define ECP56_CLEAR   { asm volatile ("bclr _LATB, #3 \n"); }
#define ECP56_TOGGLE  { asm volatile ("btg  _LATB, #3 \n"); }
#define ECP56_IS_ANALOG_INPUT  true // Pin is/is not analog input 
#define ECP56_ANSEL   _ANSELB3 // analog/digital pin configuration register bit
#define ECP56_ADCCORE 2 // index starts from zero, last index indicated shared adC core
#define ECP56_IS_SHARED_CORE false // AN input is routed to a dedicated or shared ACD core
#define ECP56_ADC_AN_INPUT 8   // ANx input pin number
#define ECP56_ADCBUF  ADCBUF8 // ADC buffer register for this input
#define ECP56_ADC_ANIE ADIELbits.IE8
#define ECP56_ADC_ANEIE ADEIELbits.EIEN8
#define ECP56_ADC_IF   _ADCAN8IF // interrupt flag bit
#define ECP56_ADC_IE   _ADCAN8IE // interrupt enable bit
#define ECP56_ADC_IP   _ADCAN8IP // interrupt priority for this analog input
#define ECP56_ADC_RDY  _AN8RDY // ADC buffer ready bit
#define _ECP56_ADC_Interrupt _ADCAN8Interrupt
#define ECP56_INIT_ANALOG	{ECP56_ANSEL = 1; ECP56_WR = PINSTATE_HIGH; ECP56_TRIS = PINDIR_INPUT;} // initialization macro for analog input
#define ECP56_INIT_OUTPUT  {ECP56_WR = PINSTATE_LOW; ECP56_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define ECP56_INIT_INPUT   {ECP56_WR = PINSTATE_HIGH; ECP56_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #46 is RB6
#define SCL_TRIS    TRISBbits.TRISB6 // GPIO direction register bit
#define SCL_WR      LATBbits.LATB6 // GPIO port latch register bit
#define SCL_RD      PORTBbits.RB6 // GPIO port register bit
#define SCL_ODC     ODCBbits.ODCB6 // GPIO port open drain configuration register bit
#define SCL_CNPU    CNPUBbits.CNPUB6 // GPIO port pull-up resistor register bit
#define SCL_CNPD    CNPDBbits.CNPDB6 // GPIO port pull-down resistor register bit
#define SCL_CNEN0   CNEN0Bbits.CNEN0B6 // GPIO port change notification Enable register bit
#define SCL_CNSTAT  CNSTATBbits.CNSTATB6 // GPIO port change notification Status register bit
#define SCL_CNEN1   CNEN1Bbits.CNEN1B6 // GPIO port change notification Edge Select Enable register bit
#define SCL_CNF     CNFBbits.CNFB6 // GPIO port change notification flag bit register bit
#define SCL_RP      38 // Number of Remappable Pin
#define SCL_SET     { asm volatile ("bset _LATB, #6 \n"); }
#define SCL_CLEAR   { asm volatile ("bclr _LATB, #6 \n"); }
#define SCL_TOGGLE  { asm volatile ("btg  _LATB, #6 \n"); }
#define SCL_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define SCL_INIT_OUTPUT  {SCL_WR = PINSTATE_LOW; SCL_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SCL_INIT_INPUT   {SCL_WR = PINSTATE_HIGH; SCL_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #45 is RB5
#define SDA_TRIS    TRISBbits.TRISB5 // GPIO direction register bit
#define SDA_WR      LATBbits.LATB5 // GPIO port latch register bit
#define SDA_RD      PORTBbits.RB5 // GPIO port register bit
#define SDA_ODC     ODCBbits.ODCB5 // GPIO port open drain configuration register bit
#define SDA_CNPU    CNPUBbits.CNPUB5 // GPIO port pull-up resistor register bit
#define SDA_CNPD    CNPDBbits.CNPDB5 // GPIO port pull-down resistor register bit
#define SDA_CNEN0   CNEN0Bbits.CNEN0B5 // GPIO port change notification Enable register bit
#define SDA_CNSTAT  CNSTATBbits.CNSTATB5 // GPIO port change notification Status register bit
#define SDA_CNEN1   CNEN1Bbits.CNEN1B5 // GPIO port change notification Edge Select Enable register bit
#define SDA_CNF     CNFBbits.CNFB5 // GPIO port change notification flag bit register bit
#define SDA_RP      37 // Number of Remappable Pin
#define SDA_SET     { asm volatile ("bset _LATB, #5 \n"); }
#define SDA_CLEAR   { asm volatile ("bclr _LATB, #5 \n"); }
#define SDA_TOGGLE  { asm volatile ("btg  _LATB, #5 \n"); }
#define SDA_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define SDA_INIT_OUTPUT  {SDA_WR = PINSTATE_LOW; SDA_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define SDA_INIT_INPUT   {SDA_WR = PINSTATE_HIGH; SDA_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #54 is RD4
#define UART_RX_TRIS    TRISDbits.TRISD4 // GPIO direction register bit
#define UART_RX_WR      LATDbits.LATD4 // GPIO port latch register bit
#define UART_RX_RD      PORTDbits.RD4 // GPIO port register bit
#define UART_RX_ODC     ODCDbits.ODCD4 // GPIO port open drain configuration register bit
#define UART_RX_CNPU    CNPUDbits.CNPUD4 // GPIO port pull-up resistor register bit
#define UART_RX_CNPD    CNPDDbits.CNPDD4 // GPIO port pull-down resistor register bit
#define UART_RX_CNEN0   CNEN0Dbits.CNEN0D4 // GPIO port change notification Enable register bit
#define UART_RX_CNSTAT  CNSTATDbits.CNSTATD4 // GPIO port change notification Status register bit
#define UART_RX_CNEN1   CNEN1Dbits.CNEN1D4 // GPIO port change notification Edge Select Enable register bit
#define UART_RX_CNF     CNFDbits.CNFD4 // GPIO port change notification flag bit register bit
#define UART_RX_RP      68 // Number of Remappable Pin
#define UART_RX_SET     { asm volatile ("bset _LATD, #4 \n"); }
#define UART_RX_CLEAR   { asm volatile ("bclr _LATD, #4 \n"); }
#define UART_RX_TOGGLE  { asm volatile ("btg  _LATD, #4 \n"); }
#define UART_RX_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define UART_RX_INIT_OUTPUT  {UART_RX_WR = PINSTATE_LOW; UART_RX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define UART_RX_INIT_INPUT   {UART_RX_WR = PINSTATE_HIGH; UART_RX_TRIS = PINDIR_INPUT;} // initialization macro for digital input

// Device Pin #55 is RD3
#define UART_TX_TRIS    TRISDbits.TRISD3 // GPIO direction register bit
#define UART_TX_WR      LATDbits.LATD3 // GPIO port latch register bit
#define UART_TX_RD      PORTDbits.RD3 // GPIO port register bit
#define UART_TX_ODC     ODCDbits.ODCD3 // GPIO port open drain configuration register bit
#define UART_TX_CNPU    CNPUDbits.CNPUD3 // GPIO port pull-up resistor register bit
#define UART_TX_CNPD    CNPDDbits.CNPDD3 // GPIO port pull-down resistor register bit
#define UART_TX_CNEN0   CNEN0Dbits.CNEN0D3 // GPIO port change notification Enable register bit
#define UART_TX_CNSTAT  CNSTATDbits.CNSTATD3 // GPIO port change notification Status register bit
#define UART_TX_CNEN1   CNEN1Dbits.CNEN1D3 // GPIO port change notification Edge Select Enable register bit
#define UART_TX_CNF     CNFDbits.CNFD3 // GPIO port change notification flag bit register bit
#define UART_TX_RP      67 // Number of Remappable Pin
#define UART_TX_SET     { asm volatile ("bset _LATD, #3 \n"); }
#define UART_TX_CLEAR   { asm volatile ("bclr _LATD, #3 \n"); }
#define UART_TX_TOGGLE  { asm volatile ("btg  _LATD, #3 \n"); }
#define UART_TX_IS_ANALOG_INPUT  false // Pin is/is not analog input 
#define UART_TX_INIT_OUTPUT  {UART_TX_WR = PINSTATE_LOW; UART_TX_TRIS = PINDIR_OUTPUT;} // initialization macro for digital output
#define UART_TX_INIT_INPUT   {UART_TX_WR = PINSTATE_HIGH; UART_TX_TRIS = PINDIR_INPUT;} // initialization macro for digital input

