microchip-pic-avr-examples/dspic33ck-power-pwm-complementary/P33C_CE110.X/MA330048_R30_pinmap.h
// Device Pin #7 is MCLR

// Device Pin #9 is VSS

// Device Pin #10 is VDD

// Device Pin #19 is AVDD

// Device Pin #20 is AVss

// Device Pin #25 is VDD

// Device Pin #26 is VSS

// Device Pin #40 is VSS

// Device Pin #41 is VDD

// Device Pin #56 is VSS

// Device Pin #57 is VDD


#define	RPOR_U1TX	    0b000001  // RPn tied to UART1 Transmit	
#define	RPOR_U1RTS	    0b000010  // RPn tied to UART1 Request-to-Send	
#define	RPOR_U2TX	    0b000011  // RPn tied to UART2 Transmit	
#define	RPOR_U2RTS	    0b000100  // RPn tied to UART2 Request-to-Send	
#define	RPOR_SDO1	    0b000101  // RPn tied to SPI1 Data Output
#define	RPOR_SCK1	    0b000110  // RPn tied to SPI1 Clock Output
#define	RPOR_SS1        0b000111  // RPn tied to SPI1 Slave Select
#define	RPOR_SDO2	    0b001000  // RPn tied to SPI2 Data Output
#define	RPOR_SCK2	    0b001001  // RPn tied to SPI2 Clock Output
#define	RPOR_SS2        0b001010  // RPn tied to SPI2 Slave Select
#define	RPOR_SDO3       0b001011  // RPn tied to SPI3 Data Output
#define	RPOR_SCK3       0b001100  // RPn tied to SPI3 Clock Output
#define	RPOR_SS3        0b001101  // RPn tied to SPI3 Slave Select
#define	RPOR_REFCLKO    0b001110  // RPn tied to Reference Clock Output
#define	RPOR_OCM1       0b001111  // RPn tied to SCCP1 Output	
#define	RPOR_OCM2       0b010000  // RPn tied to SCCP2 Output	
#define	RPOR_OCM3       0b010001  // RPn tied to SCCP3 Output	
#define	RPOR_OCM4       0b010010  // RPn tied to SCCP4 Output	
#define	RPOR_OCM5       0b010011  // RPn tied to SCCP5 Output	
#define	RPOR_OCM6       0b010100  // RPn tied to SCCP6 Output	

#define	RPO_CAN1	    0b010101  // RPn tied to CAN1 Output		
#define	RPO_CMP1	    0b010111  // RPn tied to Comparator 1 Output	
#define	RPO_CMP2	    0b011000  // RPn tied to Comparator 2 Output	
#define	RPO_CMP3	    0b011001  // RPn tied to Comparator 3 Output	
#define	RPO_U3TX	    0b011011  // RPn tied to UART3 Transmit		
#define	RPO_U3RTS	    0b011100  // RPn tied to UART3 Request-to-Send		
#define	RPO_PWM4H	    0b100010  // RPn tied to PWM4H Output		
#define	RPO_PWM4L	    0b100011  // RPn tied to PWM4L Output		
#define	RPO_PWMEA	    0b100100  // RPn tied to PWM Event A Output
#define	RPO_PWMEB	    0b100101  // RPn tied to PWM Event B Output
#define	RPO_QEICMP1	    0b100110  // RPn tied to QEI1 Comparator Output	
#define	RPO_QEICMP2	    0b100111  // RPn tied to QEI2 Comparator Output	
#define	RPO_CLC1OUT	    0b101000  // RPn tied to CLC1 Output		
#define	RPO_CLC2OUT	    0b101001  // RPn tied to CLC2 Output		
#define	RPO_OCM7	    0b101010  // RPn tied to SCCP7 Output		
#define	RPO_OCM8	    0b101011  // RPn tied to SCCP8 Output		
#define	RPO_PWMEC	    0b101100  // RPn tied to PWM Event C Output
#define	RPO_PWMED	    0b101101  // RPn tied to PWM Event D Output
#define	RPO_PTGTRG24	0b101110  // PTG Trigger Output 24			
#define	RPO_PTGTRG25	0b101111  // PTG Trigger Output 25			
#define	RPO_SENT1OUT	0b110000  // RPn tied to SENT1 Output		
#define	RPO_SENT2OUT	0b110001  // RPn tied to SENT2 Output		
#define	RPO_MCCP9A      0b110010  // RPn tied to MCCP9 Output A	
#define	RPO_MCCP9B      0b110011  // RPn tied to MCCP9 Output B	
#define	RPO_MCCP9C      0b110100  // RPn tied to MCCP9 Output C	
#define	RPO_MCCP9D      0b110101  // RPn tied to MCCP9 Output D	
#define	RPO_MCCP9E      0b110110  // RPn tied to MCCP9 Output E	
#define	RPO_MCCP9F      0b110111  // RPn tied to MCCP9 Output F	
#define	RPO_CLC3OUT     0b111011  // RPn tied to CLC4  Output		
#define	RPO_CLC4OUT     0b111100  // RPn tied to CLC4  Output		
#define	RPO_U1DTR       0b111101  // RPn tied to UART1 DTR		
#define	RPO_U2DTR       0b111110  // RPn tied to UART2 DTR		
#define	RPO_U3DTR       0b111111  // RPn tied to UART3 DTR		


#endif	/* __MA330048_P33CK_R30_PINMAP_H__ */
